// UNI_SCRIPT - универсальный скрипт на языке 1С//	VERSION: 2020.08.25
// Версия
// TO-DO
//	1. Добавить определение V83.ComConnector где определять 83 по платформе(?)	
//  2. Там где используется COmConnector использовать 	ОсвободитьОбъект(Соединение);	ОсвободитьОбъект(COMОбъект);	ВыполнитьСборкуМусора();
//
// ПОДДЕРЖИВАЕМЫЕ КОМАНДЫ:
//		+ /DumpConfigToFiles 
//				- /F <путь> (тип базы - файловая)
//				- /S <адрес> (тип базы - серверная, <Имя компьютера, работающего сервером приложений>\<Ссылочное имя информационной базы, известное в рамках сервера 1С:Предприятия 8>)
//				- /N (логин администратора ИБ, если не задан, то без логина)
//				- /P (пароль администратора ИБ)
//				- /UPath <путь> (Путь выгрузки файлов)
//				- /Format формат выгрузки (Plain)
//		+ /DumpIB		Резервная копия с блокировкой сеансов
//			Параметры запуска:
//				- /F <путь> (тип базы - файловая)
//				- /S <адрес> (тип базы - серверная, <Имя компьютера, работающего сервером приложений>\<Ссылочное имя информационной базы, известное в рамках сервера 1С:Предприятия 8>)
//				- /N (логин администратора ИБ, если не задан, то без логина)
//				- /P (пароль администратора ИБ)
//				- /CN (логин администратора кластера серверов, если не задан, то не авторизоваться на кластере)
//				- /CP (пароль администратора кластера серверов)
//				- /UC (код блокировки, если не задано, то блокировка не ставится)
//				- /Format (формат имени файла бэкапа, если не задано, то будет использован формат "yyyyMMddHHmmss")
//				- /UCMsg (текст сообщения пользователям при блокировке работы ИБ)
//				- /LOG <имя файла> (не обязательный параметр, путь к файлу логов, записи добавляются в конец, в виде Дата, Тип сообщения([INFO ], [ERROR], [WARNG]), Сообщение)
//				- /UPath <путь> (Путь выгрузки ИБ)
//				- /UCount (количество копий, которые необходимо оставить)
//				- /Pref (префикс имя файла бэкапа)
// 	
//		+ /RestoreIB	Восстановление резервеной копии в ИБ
//				- /F <путь> (тип базы - файловая)
//				- /S <адрес> (тип базы - серверная, <Имя компьютера, работающего сервером приложений>\<Ссылочное имя информационной базы, известное в рамках сервера 1С:Предприятия 8>)
//				- /N (логин администратора ИБ, если не задан, то без логина)
//				- /P (пароль администратора ИБ)
//				- /CN (логин администратора кластера серверов, если не задан, то не авторизоваться на кластере)
//				- /CP (пароль администратора кластера серверов)
//				- /UC (код блокировки)
//				- /UCMsg (Текст сообщения пользователям при блокировке работы ИБ)
//				- /LOG <имя файла> (не обязательный параметр, путь к файлу логов, записи добавляются в конец, в виде Дата, Тип сообщения([INFO ], [ERROR], [WARNG]), Сообщение)
//				- /UPath <путь> (Путь к файлу dt)
//
//		+ /Lock			Блокировка сеансов пользователей
//			Параметры запуска:
//				- /F <путь> (тип базы - файловая)
//				- /S <адрес> (тип базы - серверная, <Имя компьютера, работающего сервером приложений>\<Ссылочное имя информационной базы, известное в рамках сервера 1С:Предприятия 8>)
//				- /N (логин админситратора ИБ, если не задан, то без логина)
//				- /P (пароль администратора ИБ)
//				- /UC (код блокировки, если не задано, то блокировка не ставится)
//				- /UCMsg (Текст сообщения пользователям при блокировке работы ИБ)
//				- /LOG
//				- /LockBegin (время начала блокировки сеансов)
//				- /LockEnd (время окончания блокировки сеансов)
//
//		+ /Unlock		Разблокировка сеансов пользователей
//			Параметры запуска:
//				- /F <путь> (тип базы - файловая)
//				- /S <адрес> (тип базы - серверная, <Имя компьютера, работающего сервером приложений>\<Ссылочное имя информационной базы, известное в рамках сервера 1С:Предприятия 8>)
//				- /N (логин админситратора ИБ, если не задан, то без логина)
//				- /P (пароль администратора ИБ)
//				- /LOG
//
//		+ /Terminate	Прерывание сеансов работы пользователей по условиями или без
//			Параметры запуска:
//				- /F <путь> (тип базы - файловая)
//				- /S <адрес> (тип базы - серверная, <Имя компьютера, работающего сервером приложений>\<Ссылочное имя информационной базы, известное в рамках сервера 1С:Предприятия 8>)
//				- /N (логин админситратора ИБ, если не задан, то без логина)
//				- /P (пароль администратора ИБ)
//				- /CN (логин администратора кластера серверов, если не задан, то не авторизоваться на кластере)
//				- /CP (пароль администратора кластера серверов)
//				- /UTime (время в секундах, для удаления устаревших сеансов)
//				- /LOG
//
//		+ /ClearOldFiles Удаление файлов по заданной маске с учетом последней даты изменения (устаревших)
//			Параметры запуска:
//				- /UPath <путь> (каталог с файлами)
//				- /UMask <маска> (маска имени файла для отбора файлов)
//				- /UCount <количество> (количество файлов, которые необходимо оставить)
//
//		+ /TestUpdate Тестирование установки обновления. Обновление устанавливается на
//			Параметры запуска:
//				- /VerPL (версия платформы, например, 8.3.8.1861)
//				- /NVer (номер версии обновления для тестирования, например 3.0.6.1)
//				- /NVerRab (номер рабочей версии, на которую будет устанавливаться обновление, например, 3.0.5.5)
//				- /UPath <путь> (каталог сборки, где будет произведено тестирование обновления)
//
//		+ /CopyFTP Копирования файла на FTP (ПОКА НЕ ПОДДЕРЖИВАЕТСЯ, ВВИДУ ОТСУТСТВИЯ ПОДДЕРЖКИ FTP в OneScript, добавлено в виде заготовки)
//			Параметры запуска:
//				- /UPath <путь к файлу> (файл на локальной машине для копирования по FTP)
//				- /N (логин FTP)
//				- /P (пароль FTP)
//				- /UServer <имя> (имя или ip-адрес сервера FTP)
//				- /UPathFTP <путь> (каталог на FTP куда необходимо скопировать файлы)
//
//		+ /BuildDistribRepo создание дистрибутива по шагам
//			1. Загружаются все изменения из хранилища
//			2. Запустить в пользовательском режиме и подтвердить легальность обновления (если необходимо)
//			3. Создание файла поставщика
//			4. Создание папок "Полный", "Обновление", "Дополнительные файлы"
//			5. Создание файлов 1cv8upd.htm, ReadMe.txt, UpdInfo.txt в папке "Дополнительные файлы"
//			4. Сбор дистрибутива, включающего в себя конфигурацию поставщика
//			Параметры запуска:
//				- /F <путь> (тип базы - файловая)
//				- /S <адрес> (тип базы - серверная, <Имя компьютера, работающего сервером приложений>\<Ссылочное имя информационной базы, известное в рамках сервера 1С:Предприятия 8>)
//				- /N (логин администратора ИБ, если не задан, то без логина)
//				- /P (пароль администратора ИБ)
//				- /ConfigurationRepositoryF <путь> (Путь к хранилищу конфигурации)
//				- /ConfigurationRepositoryN логин
//				- /ConfigurationRepositoryP пароль
//				- /Legal "Y" (делать проверку легальности)
//				- /UPath <путь> (корневой каталог с обновлениями, где будет создан дистрибутив)
//				- /NVer (номера версий обновления для которой делается обновление, например "3.0.6.1,3.0.6.2")
//				- /NeedVerPL (номер версии необходимой платформы (информативно 8.3.6))
//
//		+ /SaveLastConfigUpdateText получает из конфигурации из макета ОписаниеИзмененийСистемы текст последнего обновления и сохраняет его в файл
//				- /F <путь> (тип базы - файловая)
//				- /S <адрес> (тип базы - серверная, <Имя компьютера, работающего сервером приложений>\<Ссылочное имя информационной базы, известное в рамках сервера 1С:Предприятия 8>)
//				- /N (логин администратора ИБ, если не задан, то без логина)
//				- /P (пароль администратора ИБ)
//				- /UPath куда сохранить
//				- /Maket имя общего макета для создания файла с новостями, если не определено, то равен "ОписаниеИзмененийСистемы"
//		+ /ConfigurationRepositoryUpdateCfg обновляет конфигурацию из хранилища
//				- /F <путь> (тип базы - файловая)
//				- /S <адрес> (тип базы - серверная, <Имя компьютера, работающего сервером приложений>\<Ссылочное имя информационной базы, известное в рамках сервера 1С:Предприятия 8>)
//				- /N (логин администратора ИБ, если не задан, то без логина)
//				- /P (пароль администратора ИБ)
//				- /ConfigurationRepositoryF <путь> (Путь к хранилищу конфигурации)
//				- /ConfigurationRepositoryN логин
//				- /ConfigurationRepositoryP пароль
//		+ /LoadConfigFromFiles обновляет конфигурацию из папки с выгруженной конфигурацией (git)
//				- /F <путь> (тип базы - файловая)
//				- /S <адрес> (тип базы - серверная, <Имя компьютера, работающего сервером приложений>\<Ссылочное имя информационной базы, известное в рамках сервера 1С:Предприятия 8>)
//				- /N (логин администратора ИБ, если не задан, то без логина)
//				- /P (пароль администратора ИБ)
//				- /Catalog <путь> (Путь к папке с выгруженной конфигурацией в файлы)
//		+ /GitLoad - получить изменения по определенной ветке из Git
//				- /Catalog <путь> (Путь к папке с выгруженной конфигурацией в файлы)
//				- /Branch <ветка> (ветка в GIT)
//
//		+ /EdtProjectExportToConfigFiles  - экспортировать проект 1C:Enterprise Development Tools в файлы конфигурации платформы 1С:Предприятия.
//				ring edt workspace export --project %CI_PROJECT_DIR%/ --configuration-files %CI_PROJECT_DIR%/config --workspace-location %CI_PROJECT_DIR%/workspace
//				- /Project <проект> (Директория, содержащая проект 1C:Enterprise Development Tools.)
//				- /ConfigurationFiles <адрес> (Обязательный параметр Директория для экспорта файлов конфигурации платформы 1С:Предприятия)
//				- /WorkspaceLocation (Обязательный параметр Директория рабочего простанства для запуска 1C:Enterprise Development Tools.)
//
//		+ /CreateInfoBase - создание пустой информационной базы в каталоге
//				- /F <путь> (тип базы - файловая)
//
//		- /BuildDistrib создание дистрибутива по шагам
//			1. Создание файла поставщика
//			2. Создание папок "Полный", "Обновление", "Дополнительные файлы"
//			3. Создание файлов 1cv8upd.htm, ReadMe.txt, UpdInfo.txt в папке "Дополнительные файлы"
//			4. Сбор дистрибутива, включающего в себя конфигурацию поставщика
//			Параметры запуска:
//				- /F <путь> (тип базы - файловая)
//				- /S <адрес> (тип базы - серверная, <Имя компьютера, работающего сервером приложений>\<Ссылочное имя информационной базы, известное в рамках сервера 1С:Предприятия 8>)
//				- /N (логин администратора ИБ, если не задан, то без логина)
//				- /P (пароль администратора ИБ)
//				- /UPath <путь> (корневой каталог с обновлениями, где будет создан дистрибутив)
//				- /NVer (номера версий обновления для которой делается обновление, например "3.0.6.1,3.0.6.2")
//				- /NeedVerPL (номер версии необходимой платформы (информативно 8.3.6))
//				- /Version (номер версии обновления)
//
//		+ /Save1cv8_mft - создание файла 1cv8.mft для обновления
//				- /F <путь> (тип базы - файловая)
//				- /S <адрес> (тип базы - серверная, <Имя компьютера, работающего сервером приложений>\<Ссылочное имя информационной базы, известное в рамках сервера 1С:Предприятия 8>)
//				- /N (логин администратора ИБ, если не задан, то без логина)
//				- /P (пароль администратора ИБ)
//				- /UPath <путь> (корневой каталог, где будет создан файл)
//				- /Destination
//				- /DestinationDemo
//				- /Vendor
//
//		+ /SaveInstall_edf - создание файла install.edf для обновления
//				- /F <путь> (тип базы - файловая)
//				- /S <адрес> (тип базы - серверная, <Имя компьютера, работающего сервером приложений>\<Ссылочное имя информационной базы, известное в рамках сервера 1С:Предприятия 8>)
//				- /N (логин администратора ИБ, если не задан, то без логина)
//				- /P (пароль администратора ИБ)
//				- /UPath <путь> (корневой каталог, где будет создан файл)
//
//		+ /SetURLS
//				- FileHTML
//				- FileTXT
//				- FileURL
//
//		+ /SendNews
//				- URL
//				- IDProgram
//				- IDCatalog
//				- File

#Использовать gitrunner
#Использовать v8runner
#Использовать cmdline
#Использовать logos
#Использовать tempfiles

Перем Конфигуратор;
Перем Парсер;
Перем Параметры;
Перем ГитРепозиторий;
Перем КодВозврата;
Перем Лог;

Процедура ЗадатьНачальныеНастройки()	
	
	КодВозврата 	= 0;
	Конфигуратор 	= Новый УправлениеКонфигуратором();
	Парсер 			= Новый ПарсерАргументовКоманднойСтроки();
	Параметры		= ЗаполнитьПараметры();
	ГитРепозиторий 	= Новый ГитРепозиторий();
	
	Лог 			= Логирование.ПолучитьЛог("oscript.app.uni_script");
	Лог.УстановитьРаскладку(ЭтотОбъект);	
	
	Если АргументыКоманднойСтроки.Количество() = 0 Тогда		
		Лог.Ошибка("Не заданы аргументы командной строки!");
		КодВозврата = 1;
		ЗавершитьРаботу(1);
	КонецЕсли;	
	
КонецПроцедуры

Функция ЗаполнитьПараметры()
	
	Парсер.ДобавитьПараметр("ИмяКоманды"); 							// Имя команды 
	Парсер.ДобавитьИменованныйПараметр("/F");							// База файловая
	Парсер.ДобавитьИменованныйПараметр("/S");							// База серверная
	Парсер.ДобавитьИменованныйПараметр("/N");							// Логин админиcтратора ИБ
	Парсер.ДобавитьИменованныйПараметр("/P"); 						// Пароль администратора ИБ
	Парсер.ДобавитьИменованныйПараметр("/CN"); 						// Логин администратора кластера серверов
	Парсер.ДобавитьИменованныйПараметр("/CP"); 						// Пароль администратора кластера серверов
	Парсер.ДобавитьИменованныйПараметр("/UC");						// Код блокировки
	Парсер.ДобавитьИменованныйПараметр("/Format");					// Формат имение бэкапа
	Парсер.ДобавитьИменованныйПараметр("/UCMsg");						// Текст сообщения пользователям
	Парсер.ДобавитьИменованныйПараметр("/LOG");						// Сохранять лог - файл
	Парсер.ДобавитьИменованныйПараметр("/UTime");						// Время в секундах
	Парсер.ДобавитьИменованныйПараметр("/UPath");						// Путь сохранения
	Парсер.ДобавитьИменованныйПараметр("/LockBegin");					// Время начала блокировки сеансов
	Парсер.ДобавитьИменованныйПараметр("/LockEnd");					// Время окончания блокировки сеансов
	Парсер.ДобавитьИменованныйПараметр("/UCount");					// Количество копий, которые необходимо оставить после бэкапа
	Парсер.ДобавитьИменованныйПараметр("/Pref");						// Префикс имени файла бэкапа
	Парсер.ДобавитьИменованныйПараметр("/UMask");						// Маска имени файла	
	Парсер.ДобавитьИменованныйПараметр("/NVer");						// Номер версии обновления для тестирования
	Парсер.ДобавитьИменованныйПараметр("/NVerRab");					// Номер рабочей версии, на которую будет устанавливаться обновление 
	Парсер.ДобавитьИменованныйПараметр("/VerPL");						// Версия платформы
	Парсер.ДобавитьИменованныйПараметр("/UPathFTP");					// Каталог на FTP
	Парсер.ДобавитьИменованныйПараметр("/UServer");					// Сервер FTP
	Парсер.ДобавитьИменованныйПараметр("/ConfigurationRepositoryF");	// Репозиторий путь
	Парсер.ДобавитьИменованныйПараметр("/ConfigurationRepositoryN");	// Репозиторий имя пользователя
	Парсер.ДобавитьИменованныйПараметр("/ConfigurationRepositoryP");	// Репозиторий пароль
	Парсер.ДобавитьИменованныйПараметр("/Legal");						// Подтверждать легальность обновления
	Парсер.ДобавитьИменованныйПараметр("/NeedVerPL");					// Необходимая версия ПО
	Парсер.ДобавитьИменованныйПараметр("/Maket");						// Имя макета
	Парсер.ДобавитьИменованныйПараметр("/Catalog");					// Имя папки
	Парсер.ДобавитьИменованныйПараметр("/Branch");					// Ветка GIT
	Парсер.ДобавитьИменованныйПараметр("/Project");					// Проект
	Парсер.ДобавитьИменованныйПараметр("/ConfigurationFiles");		// 
	Парсер.ДобавитьИменованныйПараметр("/WorkspaceLocation");			// 
	Парсер.ДобавитьИменованныйПараметр("/Version");					// 
	Парсер.ДобавитьИменованныйПараметр("/Destination");				// 
	Парсер.ДобавитьИменованныйПараметр("/DestinationDemo");
	Парсер.ДобавитьИменованныйПараметр("/Vendor");
	Парсер.ДобавитьИменованныйПараметр("/Name");	
	Парсер.ДобавитьИменованныйПараметр("/File");	
	Парсер.ДобавитьИменованныйПараметр("/FileURL");	
	Парсер.ДобавитьИменованныйПараметр("/URL");	
	Парсер.ДобавитьИменованныйПараметр("/IDProgram");	
	Парсер.ДобавитьИменованныйПараметр("/IDCatalog");	
	
	Возврат Парсер.Разобрать(АргументыКоманднойСтроки);
	
КонецФункции

Функция Форматировать(Знач Уровень, Знач Сообщение) Экспорт

    Возврат СтрШаблон("%1: %2 - %3", ТекущаяДата(), УровниЛога.НаименованиеУровня(Уровень), Сообщение);

КонецФункции

Процедура юсВыполнитьКоманду()
	
	ИмяКоманды 			= Параметры["ИмяКоманды"];
	ПутьКБазеСерверной 	= Параметры["/S"];
	ПутьКБазеФайловой 	= Параметры["/F"];
	
	ВРегИмяКоманды		= ВРег(ИмяКоманды);
	
	Если ВРегИмяКоманды = "/RESTOREIB" Тогда		
		Если ЗначениеЗаполнено(ПутьКБазеСерверной) Тогда
			УстановитьБлокировкуСеансов();
			ПрерватьСеансыПользователей();
			ЗагрузитьИБИзФайла();
			СнятьБлокировкуСеансов();
		Иначе
			ЗагрузитьИБИзФайла();		
		КонецЕсли;		
	КонецЕсли;
	
	Если ВРегИмяКоманды = "/DUMPIB" Тогда
		Если ЗначениеЗаполнено(ПутьКБазеСерверной) Тогда
			УстановитьБлокировкуСеансов();
			ПрерватьСеансыПользователей();
			ВыгрузитьИБВФайл();			
			СнятьБлокировкуСеансов();
			юсУдалитьФайлы();
		Иначе
			ВыгрузитьИБВФайл();
		КонецЕсли;			
	КонецЕсли;
	
	Если ВРегИмяКоманды = "/DUMPCONFIGTOFILES" Тогда
		ВыгрузитьКонфигурациюВКаталог();			
	КонецЕсли;	
	
	Если ВРегИмяКоманды = "/LOCK" Тогда
		УстановитьБлокировкуСеансов();		
	КонецЕсли;
	
	Если ВРегИмяКоманды = "/UNLOCK" Тогда
		СнятьБлокировкуСеансов();		
	КонецЕсли;
	
	Если ВРегИмяКоманды = "/TERMINATE" Тогда
		ПрерватьСеансыПользователей();		
	КонецЕсли;
	
	Если ВРегИмяКоманды = "/CLEAROLDFILES" Тогда
		юсУдалитьФайлы();		
	КонецЕсли;
	
	Если ВРегИмяКоманды = "/TESTUPDATE" Тогда 
		СоздатьВременныеИБ();	
	КонецЕсли;

	Если ВРегИмяКоманды = "/COPYFTP" Тогда 
		КопироватьНаFTP();
	КонецЕсли;

	Если ВРегИмяКоманды = "/BUILDDISTRIBREPO" Тогда 
		СоздатьДистрибутивИзХранилища();
	КонецЕсли;

	Если ВРегИмяКоманды = "/SAVELASTCONFIGUPDATETEXT" Тогда 
		ПолучитьОписаниеОбновленияИзМакета();
	КонецЕсли;

	Если ВРегИмяКоманды = "/CONFIGURATIONREPOSITORYUPDATECFG" Тогда 
		ОбновитьКонфигурациюИзХранилища();
	КонецЕсли;
	
	Если ВРегИмяКоманды = "/LOADCONFIGFROMFILES" Тогда 
		ОбновитьКонфигурациюИзКаталога();
	КонецЕсли;
	
	Если ВРегИмяКоманды = "/GITLOAD" Тогда 
		GitПерейтиВВеткуИПолучить();
	КонецЕсли;	

	Если ВРегИмяКоманды = ВРег("/EdtProjectExportToConfigFiles") Тогда 
		ЭкспортПроектаEDTВXML();
	КонецЕсли;
	
	Если ВРегИмяКоманды = ВРег("/CreateInfoBase") Тогда 
		СоздатьИнформационнуюБазу();
	КонецЕсли;

	Если ВРегИмяКоманды = "/BUILDDISTRIB" Тогда 
		СоздатьДистрибутив();
	КонецЕсли;	
	
	Если ВРегИмяКоманды = ВРег("/Save1cv8_mft") Тогда 
		Создать_1cv8_mft();
	КонецЕсли;	
	
	Если ВРегИмяКоманды = ВРег("/SaveInstall_edf") Тогда 
		Создать_Install_edf();
	КонецЕсли;

	Если ВРегИмяКоманды = ВРег("/SetURLS") Тогда 
		УстановитьURLы();
	КонецЕсли;
	
	Если ВРегИмяКоманды = ВРег("/SendNews") Тогда 
		ОтправкаНовостей();
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализацияСистемныхПеременных()

	СтрокаПодключения 		= "";
	ПутьКБазе				= "";
	ИмяАдминистратораИБ 	= ?(Параметры["/N"] <> Неопределено, Параметры["/N"], "");
	ПарольАдминистратораИБ 	= ?(Параметры["/P"] <> Неопределено, Параметры["/P"], "");
	КодРазрешения			= ?(Параметры["/UC"] <> Неопределено, Параметры["/UC"], "");	
	
	Если Параметры["/S"] <> Неопределено Тогда
		мПутьКБазе				= Параметры["/S"];
		ИмяСервера 				= Лев(мПутьКБазе, Найти(мПутьКБазе,"\") - 1);
		ИмяБазы					= Прав(мПутьКБазе, СтрДлина(мПутьКБазе) - Найти(мПутьКБазе,"\"));
		ПутьКБазе				= "/S""" + мПутьКБазе + """";				
		СтрокаПодключения		= "Srvr=""" + ИмяСервера + """;Ref=""" + ИмяБазы + """;";
		Лог.Информация("Начало работы с базой """ + ИмяБазы + """");
	Иначе
		ПутьКБазе			= "/F""" + Параметры["/F"] + """";
		СтрокаПодключения	= "File=""" + Параметры["/F"] + """;";
		Если ПутьКБазе<> "/F""""" Тогда 
			Лог.Информация("Начало работы с базой """ + Параметры["/F"] + """");
		КонецЕсли;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяАдминистратораИБ) Тогда
		СтрокаПодключения = СтрокаПодключения + "Usr=""" + ИмяАдминистратораИБ + """;";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПарольАдминистратораИБ) Тогда
		СтрокаПодключения = СтрокаПодключения + "Pwd=""" + ПарольАдминистратораИБ + """;";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПутьКБазе) Тогда
		Конфигуратор.УстановитьКонтекст(ПутьКБазе, ИмяАдминистратораИБ, ПарольАдминистратораИБ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодРазрешения) Тогда 
		СтрокаПодключения = СтрокаПодключения + "UC=""" + КодРазрешения + """;";
		Конфигуратор.УстановитьКлючРазрешенияЗапуска(КодРазрешения);
	КонецЕсли;
	
	Попытка
		СтрокаПодключения = Сред(СтрокаПодключения,1,СтрДлина(СтрокаПодключения) - 1);	
	Исключение
	КонецПопытки;
	
	Параметры.Вставить("ПутьКБазе", 			ПутьКБазе);
	Параметры.Вставить("СтрокаПодключения", 	СтрокаПодключения);
	Параметры.Вставить("ИмяСервера", 			ИмяСервера);
	Параметры.Вставить("ИмяБазы", 			ИмяБазы);
	
КонецПроцедуры

Функция ДополнитьСтрокуСлешем(Знач Стр)
	
	Если ПустаяСтрока(Стр) Тогда
		Возврат "\";
	КонецЕсли;
	
	Возврат Стр + ?(Прав(Стр, 1) = "\", "", "\");
	
КонецФункции

Процедура УстановитьБлокировкуСеансов()
	
	Соединение 			= Неопределено;
	СтрокаПодключения 	= Параметры["СтрокаПодключения"];
	ВремяНачала			= Параметры["/LockBegin"];
	ВремяОкончания		= Параметры["/LockEnd"];
	КодРазрешения		= Параметры["/UC"];
	Сообщение			= Параметры["/UCMsg"];
	V8 					= Новый COMObject("V83.COMConnector");
	
	Попытка
		Соединение 				= V8.Connect(СтрокаПодключения);
		Блокировка 				= Соединение.NewObject("БлокировкаСеансов");
		Блокировка.Установлена	= Истина;

		Если ЗначениеЗаполнено(ВремяНачала) Тогда
			Блокировка.Начало 	= ВремяНачала;
		Иначе
			Блокировка.Начало 	= ТекущаяДата();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВремяОкончания) Тогда
			Блокировка.Конец 	= ВремяОкончания;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КодРазрешения) Тогда 
			Блокировка.КодРазрешения= КодРазрешения;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Сообщение) Тогда	
			Блокировка.Сообщение= Сообщение;
		КонецЕсли;	
		
		Соединение.УстановитьБлокировкуСеансов(Блокировка);
		
		Лог.Информация("Блокировка сеансов установлена");
	Исключение
		Лог.Ошибка("При установке блокировки возникла ошибка: " + ОписаниеОшибки());
		КодВозврата = 2;
	КонецПопытки;
	
	Если Соединение <> Неопределено Тогда
		Попытка
			ОсвободитьОбъект(Соединение);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если V8 <> Неопределено Тогда
		Попытка
			ОсвободитьОбъект(V8);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ВыполнитьСборкуМусора();
	
КонецПроцедуры

Процедура ПрерватьСеансыПользователей()
	
	ИмяСервера					= Параметры["ИмяСервера"];	
	ИмяБазы						= Параметры["ИмяБазы"];
	ИмяАдминистратораИБ			= Параметры["/N"];
	ПарольАдминистратораИБ 		= Параметры["/P"];	
	ИмяАдминистратораКластера 	= Параметры["/CN"];
	ПарольАдминистратораКластера= Параметры["/CP"];
	ВремяПростоя				= Параметры["/UTime"];
	Соединение 					= Неопределено;
	V8 							= Новый COMObject("V83.COMConnector");	
	Попытка		
		Агент 	 = V8.ConnectAgent(ИмяСервера);
		Кластеры = Агент.GetClusters();
		Для Каждого Кластер из Кластеры Цикл
			
			Если ЗначениеЗаполнено(ИмяАдминистратораКластера) И ЗначениеЗаполнено(ПарольАдминистратораКластера) Тогда
				Агент.Authenticate(Кластер, ИмяАдминистратораКластера, ИмяАдминистратораКластера);
			ИначеЕсли ЗначениеЗаполнено(ИмяАдминистратораКластера) Тогда
				Агент.Authenticate(Кластер,ИмяАдминистратораКластера,"");
			Иначе 
				Агент.Authenticate(Кластер,"","");
			КонецЕсли;
			
			Процессы = Агент.GetWorkingProcesses(Кластер);
			
			Для Каждого Процесс из Процессы Цикл
				Порт 	= Процесс.MainPort;
				// теперь есть адрес и порт для подключения к рабочему процессу
				РабПроц = V8.ConnectWorkingProcess(ИмяСервера + ":" + СтрЗаменить(Порт, Символы.НПП, ""));
				РабПроц.AddAuthentication(ИмяАдминистратораИБ, ПарольАдминистратораИБ);
				ИнформационнаяБаза = "";
				Базы 	= Агент.GetInfoBases(Кластер);				
				Для Каждого База из Базы Цикл
					Если ВРег(База.Name) = ВРег(ИмяБазы) Тогда
						ИнформационнаяБаза = База;
						Прервать;
					КонецЕсли;
				КонецЦикла;				
				
				Если ИнформационнаяБаза = "" Тогда
					Лог.Ошибка("ИБ не найдена!");
					КодВозврата = 3;
					ЗавершитьРаботу(КодВозврата);
				КонецЕсли;				
				
				Сеансы = Агент.GetInfoBaseSessions(Кластер, ИнформационнаяБаза);
				Для Каждого Сеанс из Сеансы Цикл					
					Если нРег(Сеанс.AppID) = "comconsole" Тогда					
						Продолжить;
					КонецЕсли;
										
					Если ЗначениеЗаполнено(ВремяПростоя) Тогда						
						КонтрольнаяДата = ТекущаяДата() - Число(ВремяПростоя);
						Если Сеанс.LastActiveAt < КонтрольнаяДата Тогда
							Агент.TerminateSession(Кластер, Сеанс);
							Лог.Информация("Сеанс " + Сеанс.UserName + " " + Сеанс.AppID + " отключен");		
						КонецЕсли;
					Иначе
						Агент.TerminateSession(Кластер, Сеанс);
						Лог.Информация("Сеанс " + Сеанс.UserName +" " + Сеанс.AppID +" отключен");		
					КонецЕсли;					
				КонецЦикла;
				
				Шаблон 	 		= РабПроц.CreateInfoBaseInfo();
				Шаблон.Name 	= ИмяБазы;
				СоединенияБазы 	= РабПроц.GetInfoBaseConnections(Шаблон); 
								
				// Разорвать соединения клиентских приложений.
				Если Не ЗначениеЗаполнено(ВремяПростоя) Тогда
					Для Каждого мСоединение Из СоединенияБазы Цикл
						Если нРег(мСоединение.AppID) = "designer" Тогда 
							Продолжить;
						КонецЕсли;
						Попытка
							РабПроц.Disconnect(мСоединение);
							Лог.Информация("Соединение " + мСоединение.UserName + " " +мСоединение.AppID+ " отключено");
						Исключение
							Лог.Ошибка("Ошибка при отключении соединения: " + ОписаниеОшибки());
							КодВозврата = 4;
						КонецПопытки;					
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;		
	Исключение
		Лог.Ошибка("Не удалось установить соединение!" + ОписаниеОшибки());
		КодВозврата = 5;
	КонецПопытки;
	
	Если Соединение <> Неопределено Тогда 
		Попытка
			ОсвободитьОбъект(Соединение);
		Исключение
		КонецПопытки;
	КонецЕсли;	
	
	Если V8 <> Неопределено Тогда
		Попытка
			ОсвободитьОбъект(V8);
		Исключение
		КонецПопытки;	
	КонецЕсли;
	
	ВыполнитьСборкуМусора();
	Лог.Информация("Завершение сеансов выполнено");
	
КонецПроцедуры

Процедура ЗагрузитьИБИзФайла()		
	
	ПутьСохранения 		= Параметры["/UPath"];	
	ПараметрыЗапуска 	= Конфигуратор.ПолучитьПараметрыЗапуска();	
	ПараметрыЗапуска.Добавить("/RestoreIB " + ПутьСохранения);	
	Лог.Информация("Начало загрузки...");
	Попытка	
	    Конфигуратор.ВыполнитьКоманду(ПараметрыЗапуска);
		Лог.Информация("Загрузка завершена");
	Исключение												   
		Лог.Ошибка("Произошла ошибка при загрузке " + Конфигуратор.ВыводКоманды());
		КодВозврата = 6;
	КонецПопытки
	
КонецПроцедуры

Процедура ВыгрузитьИБВФайл()		
	
	ПутьСохранения 				= Параметры["/UPath"];	
	ФорматИмениРезервнойКопии 	= ?(Параметры["/Format"] <> Неопределено, Параметры["/Format"], "yyyyMMddHHmmss");
	ИмяБазы						= Параметры["ИмяБазы"];
	Префикс						= Параметры["/Pref"];

	Если ЗначениеЗаполнено(Префикс) Тогда
		ПолныйПутьСохранения 	= ДополнитьСтрокуСлешем(ПутьСохранения) + Префикс + Формат(ТекущаяДата(), "ДФ=" + ФорматИмениРезервнойКопии) + ".dt";
	Иначе
		ПолныйПутьСохранения 	= ДополнитьСтрокуСлешем(ПутьСохранения) + ИмяБазы + Формат(ТекущаяДата(), "ДФ=" + ФорматИмениРезервнойКопии) + ".dt";
	КонецЕсли;
			
	// Делаем копию
	ПараметрыЗапуска 			= Конфигуратор.ПолучитьПараметрыЗапуска();
	ПараметрыЗапуска.Добавить("/DumpIB""" + ПолныйПутьСохранения + """"); 	
	Лог.Информация("Начало выгрузки");
	Попытка
	    Конфигуратор.ВыполнитьКоманду(ПараметрыЗапуска);
		Лог.Информация("Выгрузка завершена");
	Исключение												   
		Лог.Ошибка("Произошла ошибка при выгрузке " + Конфигуратор.ВыводКоманды());		
		КодВозврата = 7;
	КонецПопытки;
		
КонецПроцедуры

Процедура ВыгрузитьКонфигурациюВКаталог()

//				- /F <путь> (тип базы - файловая)
//				- /S <адрес> (тип базы - серверная, <Имя компьютера, работающего сервером приложений>\<Ссылочное имя информационной базы, известное в рамках сервера 1С:Предприятия 8>)
//				- /N (логин администратора ИБ, если не задан, то без логина)
//				- /P (пароль администратора ИБ)
//				- /UPath <путь> (Путь выгрузки файлов)
//				- /Format формат выгрузки (Plain)

	ПутьСохранения 		= Параметры["/UPath"];	

	// Делаем копию
	ПараметрыЗапуска 	= Конфигуратор.ПолучитьПараметрыЗапуска();
	ПараметрыЗапуска.Добавить("/DumpConfigToFiles """ + ПутьСохранения + """");
	Если Параметры["/Format"] <> Неопределено Тогда
		ПараметрыЗапуска.Добавить("-Format " + Параметры["/Format"]);
	КонецЕсли;
	Лог.Информация("Начало выгрузки в файлы");
	Попытка
	    Конфигуратор.ВыполнитьКоманду(ПараметрыЗапуска);
		Лог.Информация("Выгрузка завершена");
	Исключение												   
		Лог.Ошибка("Произошла ошибка при выгрузке  в файлы " + Конфигуратор.ВыводКоманды());		
		КодВозврата = 8;
	КонецПопытки;	

КонецПроцедуры

Процедура СнятьБлокировкуСеансов()
	
	Соединение 			= Неопределено;
	СтрокаПодключения 	= Параметры["СтрокаПодключения"];
	V8 					= Новый COMObject("V83.COMConnector");	
	Попытка
		Соединение 	= V8.Connect(СтрокаПодключения);	
		ТекущийРежим= Соединение.ПолучитьБлокировкуСеансов();	
		Если ТекущийРежим.Установлена Тогда
			НовыйРежим 				= Соединение.NewObject("БлокировкаСеансов");
			НовыйРежим.Установлена 	= Ложь;
			Соединение.УстановитьБлокировкуСеансов(НовыйРежим);
		КонецЕсли;
		Лог.Информация("Блокировка сеансов отключена");
	Исключение
		Лог.Ошибка("Не удалось установить соединение!");
		КодВозврата = 9;
	КонецПопытки;					
	
	Если Соединение <> Неопределено Тогда 
		Попытка
			ОсвободитьОбъект(Соединение);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если V8 <> Неопределено Тогда
		Попытка
			ОсвободитьОбъект(V8);
		Исключение
		КонецПопытки;	
	КонецЕсли;
	
	ВыполнитьСборкуМусора();
	
КонецПроцедуры

Процедура юсСообщить(ТипСообщения, ТекстСообщения)
	
	ИмяЛогФайла 	= Параметры["/LOG"];
	ТекстСообщения 	= "[" + ТекущаяДата() + "] " + "[" + ТипСообщения + "] " + ТекстСообщения;
	
	Если ЗначениеЗаполнено(ИмяЛогФайла) Тогда
		ВЛогФайл(ИмяЛогФайла, ТекстСообщения);
	Иначе
		Сообщить(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры	

Функция ВЛогфайл(ИмяФайла, ТекстСообщения)
	
	Если Найти(ИмяФайла, "\") = 0 Тогда
        ИмяФайла = КаталогПрограммы() + ИмяФайла;
        Сообщить("Лог:" + ИмяФайла);
    КонецЕсли;
	
	ТекстовыйДокумент 	= Новый ТекстовыйДокумент;
    Кодировка 			= "UTF-8" ;
    юсРазделительСтрок 	= Символы.ВК + Символы.ПС;
	
	МассивФайлов 		= НайтиФайлы(ИмяФайла);
	// если файл еще не создан добавим строку
    Если МассивФайлов.Количество() = 0 Тогда        
        ТекстовыйДокумент.ДобавитьСтроку(ТекстСообщения);    
    Иначе 
        // если файл с таким именем уже создан прочитаем его
        ТекстовыйДокумент.Прочитать(ИмяФайла, Кодировка);
		ТекстовыйДокумент.ДобавитьСтроку(ТекстСообщения);
    КонецЕсли;	
    // закрываем ТекстовыйДокумент файл
    ТекстовыйДокумент.Записать(ИмяФайла, Кодировка);
	
КонецФункции

Процедура юсУдалитьФайлы()
	
	ПутьСохранения 				= Параметры["/UPath"];	
	Префикс						= Параметры["/Pref"];
	КоличествоХранимыхАрхивов	= Число(Параметры["/UCount"]);
	МаскаФайла					= Параметры["/UMask"];
	
	Если КоличествоХранимыхАрхивов <> Неопределено Тогда
		
		Если ЗначениеЗаполнено(МаскаФайла) Тогда
			МассивФайлов = НайтиФайлы(ПутьСохранения, МаскаФайла);
		ИначеЕсли ЗначениеЗаполнено(Префикс) Тогда
			МассивФайлов = НайтиФайлы(ПутьСохранения, Префикс + "*.dt");
		Иначе
			МассивФайлов = НайтиФайлы(ПутьСохранения, "*.dt");
		КонецЕсли;	
		
		Если МассивФайлов.Количество() > КоличествоХранимыхАрхивов Тогда
			ТЗ = Новый ТаблицаЗначений;
			ТЗ.Колонки.Добавить("Файл");
			ТЗ.Колонки.Добавить("ПоследняяДатаИзменения");
			Для Каждого Файл Из МассивФайлов Цикл
				СтрокаТЗ 						= ТЗ.Добавить();
				СтрокаТЗ.Файл 					= Файл.ПолноеИмя;
				СтрокаТЗ.ПоследняяДатаИзменения = Файл.ПолучитьВремяИзменения();				
			КонецЦикла;
			ТЗ.Сортировать("ПоследняяДатаИзменения Убыв");
			Пока ТЗ.Количество() > КоличествоХранимыхАрхивов Цикл
				Попытка
					мФайл	= ТЗ[ТЗ.Количество() - 1].Файл;
					УдалитьФайлы(мФайл);
					ТЗ.Удалить(ТЗ.Количество() - 1);
				Исключение
					Лог.Ошибка("Произошла ошибка при удалении файла " + мФайл + " " + ОписаниеОшибки());
					КодВозврата = 10;
					Возврат;
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьВременныеИБ()
	
	Если ЗначениеЗаполнено(Параметры["/VerPL"]) Тогда
		мКонфигуратор 				= Новый УправлениеКонфигуратором();
		ПутьКПлатформе				= мКонфигуратор.ПолучитьПутьКВерсииПлатформы(Параметры["/VerPL"]);
	Иначе
		Лог.Ошибка("Не заполнен параметр ""/VerPL"" - версия платформы!");
		КодВозврата = 11;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры["/NVerRab"]) Тогда
		НомерВерсииДляРаботы		= Параметры["/NVerRab"];
	Иначе
		Лог.Информация("Не заполнен параметр ""/NVerRab"" - номер версии для обновления, файл dt будет взят из каталога сборки!");		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры["/NVer"]) Тогда
		НомерВерсииДляТестирования	= Параметры["/NVer"];
	Иначе
		Лог.Ошибка("Не заполнен параметр ""/NVer"" - версия для тестирования!");
		КодВозврата = 12;
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры["/UPath"]) Тогда
		мКаталогСборки = Параметры["/UPath"];		
	Иначе
		Лог.Ошибка("Не заполнен параметр ""/UPath"" - каталог сборки!");
		КодВозврата = 13;
		Возврат;
	КонецЕсли;
	
	СтрокаПодключения		= Параметры["СтрокаПодключения"];
	ПутьКБазе				= Параметры["ПутьКБазе"];
	
	//1я часть тест cfu
	//ищем файл dt рабочей версии
	Если ЗначениеЗаполнено(НомерВерсииДляРаботы) Тогда
		МассивФайлов = НайтиФайлы(Строка(ДополнитьСтрокуСлешем(мКаталогСборки) + Строка(НомерВерсииДляРаботы)), "*.dt", Истина);
	Иначе
		МассивФайлов = НайтиФайлы(мКаталогСборки, "*.dt", Ложь);
	КонецЕсли;
	
	Если МассивФайлов.Количество()>0 Тогда		
		//определяем имя иб для списка баз
		Если ЗначениеЗаполнено(НомерВерсииДляТестирования) Тогда
			ИмяИБВСписке = "Отладка_v_" + Строка(НомерВерсииДляТестирования) + "_обновление_cfu";		
		КонецЕсли;
		
		//каталог для создания временной иб для загрузки из dt
		Если ЗначениеЗаполнено(НомерВерсииДляТестирования) Тогда 
			КаталогБазы = ДополнитьСтрокуСлешем(мКаталогСборки) + "TempIB\" + НомерВерсииДляТестирования + "_load_cfu";
			Файл = Новый Файл(КаталогБазы);
			Если Не Файл.Существует() Тогда
				СоздатьКаталог(КаталогБазы);
				Лог.Информация("Каталог """ + КаталогБазы + """" + " создан.");
			ИначеЕсли Файл.ЭтоКаталог() Тогда
				УдалитьФайлы(КаталогБазы, "*.*");
				Лог.Информация("Каталог с файлами """ + КаталогБазы + """" + " очищен.");		
			КонецЕсли;	
			СтрокаПодключения = "File=" + КаталогБазы + ";";
		КонецЕсли;	
		
		//создание пустой базы
		СтрокаЗапуска = " createinfobase " + СтрокаПодключения + " /AddInList " + ИмяИБВСписке;		
		Лог.Информация("Начало работы с базой """ + КаталогБазы + """");	
		ЗапуститьПриложение("""" + ПутьКПлатформе+ """" + СтрокаЗапуска, , Истина);		
		Лог.Информация("Временная база """ + КаталогБазы + """" + " создана.");
		
		//загрузка dt файла
		мКонфигуратор 	= Новый УправлениеКонфигуратором();
		ПутьКБазе 		= "/F""" + КаталогБазы + """";					
		мКонфигуратор.УстановитьКонтекст(ПутьКБазе,"","");		
		ПараметрыЗапуска= мКонфигуратор.ПолучитьПараметрыЗапуска();	
		ПараметрыЗапуска.Добавить("/RestoreIB " + МассивФайлов[0].ПолноеИмя);			
		Попытка	
			мКонфигуратор.ВыполнитьКоманду(ПараметрыЗапуска);
			Лог.Информация("Загрузка завершена");
		Исключение												   
			Лог.Ошибка("Произошла ошибка при зарузке: " + мКонфигуратор.ВыводКоманды());
			КодВозврата = 14;
		КонецПопытки;
		
		//поиск cfu
		МассивФайловcfu = НайтиФайлы(Строка(ДополнитьСтрокуСлешем(мКаталогСборки) + Строка(НомерВерсииДляТестирования)),"*.cfu",Истина);
		Если МассивФайловcfu.Количество()>0 Тогда
			Файлcfu = МассивФайловcfu[0];
			ФайлЛога= ДополнитьСтрокуСлешем(мКаталогСборки) + НомерВерсииДляТестирования + "_update_cfu.log";
			СтрокаЗапуска = " CONFIG /F""" + КаталогБазы + """ /N""Администратор"" /UpdateCfg " + """" + Файлcfu.ПолноеИмя + """" + " /UpdateDBCfg /OUT """ + ФайлЛога + """ -NoTruncate";			
			Лог.Информация("Запущено обновление ИБ """ + КаталогБазы + """");
			КодВозврата = "";		
			ЗапуститьПриложение("""" + ПутьКПлатформе+ """" + СтрокаЗапуска,,Истина,КодВозврата);		
			Лог.Информация("Обновление ИБ """ + КаталогБазы + """" + " завершено.");
			Если КодВозврата = 0 Тогда
				Лог.Информация("Обновление ИБ """ + КаталогБазы + """" + " завершено.");
			Иначе
				Лог.Ошибка("Обновление ИБ """ + КаталогБазы + """" + " завершено c ошибками, см. " + ФайлЛога);
				КодВозврата = 15;
				Возврат;
			КонецЕсли;		
		КонецЕсли;
		
		//принятие изменений
		Лог.Информация("Для ИБ""" + КаталогБазы + """" + " запущено принятие обновления.");
		ИмяCOMСоединителя = "V83.COMConnector";
		
		Попытка
			COMОбъект = Новый COMОбъект(ИмяCOMСоединителя);
		Исключение
			Лог.Ошибка("Не удалось подключиться через V83.COMConnector по причине: " + ОписаниеОшибки());
			КодВозврата = 16;
			Возврат;
		КонецПопытки;
		
		СтрокаСоединения = "File = """ + КаталогБазы + """; Usr = ""Администратор""";
		
		Попытка
        Соединение = COMОбъект.Connect(СтрокаСоединения);
		Исключение
			Лог.Ошибка("Не удалось подключиться через V83.COMConnector по причине: " + ОписаниеОшибки());
			КодВозврата = 17;
			Возврат;
		КонецПопытки;
		
		Попытка
			Соединение.ОбновлениеИнформационнойБазы.ВыполнитьОбновлениеИнформационнойБазы(Ложь);
			Лог.Информация("Принятие обновления для ИБ """ + КаталогБазы + """" + " завершено.");
		Исключение
			Лог.Ошибка("Не удалось принять обновление по причине: " + ОписаниеОшибки());
			КодВозврата = 18;
		КонецПопытки;
		
		Если Соединение <> Неопределено Тогда
			Попытка
				ОсвободитьОбъект(Соединение);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Если COMОбъект <> Неопределено Тогда
			Попытка
				ОсвободитьОбъект(COMОбъект);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		ВыполнитьСборкуМусора();
	Иначе
		Лог.Ошибка("Файл выгрузки dt не найден. Создание временной базы отменено.");
		КодВозврата = 19;
	КонецЕсли;
	
	//2я часть тест шаблона 
	//поиск cf
	МассивФайловcf = НайтиФайлы(Строка(ДополнитьСтрокуСлешем(мКаталогСборки) + Строка(НомерВерсииДляТестирования)),"*.cf",Истина);	
	Если МассивФайловcf.Количество()>0 Тогда
		//определяем имя иб для списка баз
		Если ЗначениеЗаполнено(НомерВерсииДляТестирования) Тогда
			ИмяИБВСписке = "Отладка_v_" + Строка(НомерВерсииДляТестирования) + "_разворачивание_cf";		
		КонецЕсли;
		
		//каталог для создания временной иб для загрузки из dt
		Если ЗначениеЗаполнено(НомерВерсииДляТестирования) Тогда 
			КаталогБазы = ДополнитьСтрокуСлешем(мКаталогСборки) + "TempIB\" + НомерВерсииДляТестирования + "_load_cf";
			Файл = Новый Файл(КаталогБазы);
			Если Не Файл.Существует() Тогда
				СоздатьКаталог(КаталогБазы);
				Лог.Информация("Каталог """ + КаталогБазы + """" + " создан.");
			ИначеЕсли Файл.ЭтоКаталог() Тогда
				УдалитьФайлы(КаталогБазы, "*.*");
				Лог.Информация("Каталог с файлами """ + КаталогБазы + """" + " очищен.");		
			КонецЕсли;	
			СтрокаПодключения = "File=" + КаталогБазы + ";";
		КонецЕсли;
		
		//создание базы
		СтрокаЗапуска = " createinfobase " + СтрокаПодключения + "/UseTemplate """ + МассивФайловcf[0].ПолноеИмя + """" + " /AddInList " + ИмяИБВСписке;		
		Лог.Информация("Начало работы с базой """ + КаталогБазы + """");	
		ЗапуститьПриложение("""" + ПутьКПлатформе+ """" + СтрокаЗапуска, , Истина);		
		Лог.Информация("Временная база """ + КаталогБазы + """" + " создана.");
		
		//принятие изменений
		Лог.Информация("Для ИБ""" + КаталогБазы + """" + " запущено принятие обновления.");
		ИмяCOMСоединителя = "V83.COMConnector";
		
		Попытка
			COMОбъект = Новый COMОбъект(ИмяCOMСоединителя);
		Исключение
			Лог.Ошибка("Не удалось подключиться через V83.COMConnector по причине: " + ОписаниеОшибки());
			КодВозврата = 20;
			Возврат;
		КонецПопытки;
		
		СтрокаСоединения = "File = """ + КаталогБазы + """;";
		
		Попытка
			Соединение = COMОбъект.Connect(СтрокаСоединения);
		Исключение
			Лог.Ошибка("Не удалось подключиться через V83.COMConnector по причине: " + ОписаниеОшибки());
			КодВозврата = 21;
			Возврат;
		КонецПопытки;
		
		Попытка
			Соединение.ОбновлениеИнформационнойБазы.ВыполнитьОбновлениеИнформационнойБазы(Ложь);
			Соединение.УправлениеITОтделом8УФОбновлениеИнформационнойБазыБСП.ПервыйЗапуск();
		Исключение
			Лог.Ошибка("Не удалось принять обновление по причине: " + ОписаниеОшибки());
			КодВозврата = 22;
		КонецПопытки;
		
		Если Соединение <> Неопределено Тогда
			Попытка
				ОсвободитьОбъект(Соединение);
			Исключение
			КонецПопытки;
		КонецЕсли;

		Если COMОбъект <> Неопределено Тогда
			Попытка
				ОсвободитьОбъект(COMОбъект);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		ВыполнитьСборкуМусора();
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает внешнее соединение с информационной базой по переданным параметрам подключения и возвращает указатель
// на это соединение.
// 
// Параметры:
//  ПараметрыПодключения - Структура - параметры для установки внешнего соединения с информационной базой.
//
//    * ВерсияПлатформы                              - Строка - Версия платформы: 82; 83;
//    * ВариантРаботыИнформационнойБазы             - Число  - Вариант работы информационной базы: 0 - файловый; 1 -
//                                                             клиент-серверный;
//    * КаталогИнформационнойБазы                   - Строка - Каталог информационной базы для файлового режима работы;
//    * ИмяСервера1СПредприятия                     - Строка - Имя сервера1С:Предприятия;
//    * ИмяИнформационнойБазыНаСервере1СПредприятия - Строка - Имя информационной базы на сервере1С:Предприятия;
//    * АутентификацияОперационнойСистемы           - Булево - Признак аутентификации операционной системы при создании
//                                                             внешнего подключения к информационной базе;
//    * ИмяПользователя                             - Строка - Имя пользователя информационной базы;
//    * ПарольПользователя                          - Строка - Пароль пользователя информационной базы.
// 
// Возвращаемое значение:
//  COMОбъект, Неопределено - указатель на COM-объект соединения или Неопределено в случае ошибки;
//
Функция УстановитьВнешнееСоединениеСБазой(Знач ПараметрыПодключения) 
    
    ИмяCOMСоединителя = "V" + ПараметрыПодключения.ВерсияПлатформы + ".COMConnector";
    Попытка
        COMОбъект = Новый COMОбъект(ИмяCOMСоединителя);
    Исключение
        Лог.Ошибка("Не удалось создать COM-объект по причине: " + ОписаниеОшибки());
		КодВозврата = 23;
        Возврат Неопределено;
    КонецПопытки; 
    
    ФайловыйВариантРаботы = ПараметрыПодключения.ВариантРаботыИнформационнойБазы = 0;
    
    // Проверка корректности указания параметров.
    ОшибкаПроверкиЗаполнения = Ложь;
    Если ФайловыйВариантРаботы Тогда
        Если ПустаяСтрока(ПараметрыПодключения.КаталогИнформационнойБазы) Тогда
            ТекстСообщения = "Не задано месторасположение каталога информационной базы.";
			КодВозврата = 24;
            ОшибкаПроверкиЗаполнения = Истина;
        КонецЕсли;
    Иначе
        Если ПустаяСтрока(ПараметрыПодключения.ИмяСервера1СПредприятия) Или ПустаяСтрока(ПараметрыПодключения.ИмяИнформационнойБазыНаСервере1СПредприятия) Тогда
            ТекстСообщения = "Не заданы обязательные параметры подключения: ""Имя сервера""; ""Имя информационной базы на сервере"".";
			КодВозврата = 25;
            ОшибкаПроверкиЗаполнения = Истина;
        КонецЕсли;
    КонецЕсли;
    
    Если ОшибкаПроверкиЗаполнения Тогда
        Лог.Ошибка(ТекстСообщения);
        Возврат Неопределено;
    КонецЕсли;
    
    // Формирование строки соединения.
    ШаблонСтрокиСоединения = "[СтрокаБазы][СтрокаАутентификации]";
    
    Если ФайловыйВариантРаботы Тогда
        СтрокаБазы = "File = ""&КаталогИнформационнойБазы""";
        СтрокаБазы = СтрЗаменить(СтрокаБазы, "&КаталогИнформационнойБазы", ПараметрыПодключения.КаталогИнформационнойБазы);
    Иначе
        СтрокаБазы = "Srvr = ""&ИмяСервера1СПредприятия""; Ref = ""&ИмяИнформационнойБазыНаСервере1СПредприятия""";
        СтрокаБазы = СтрЗаменить(СтрокаБазы, "&ИмяСервера1СПредприятия",                     ПараметрыПодключения.ИмяСервера1СПредприятия);
        СтрокаБазы = СтрЗаменить(СтрокаБазы, "&ИмяИнформационнойБазыНаСервере1СПредприятия", ПараметрыПодключения.ИмяИнформационнойБазыНаСервере1СПредприятия);
    КонецЕсли;
    
    Если ПараметрыПодключения.АутентификацияОперационнойСистемы Тогда
        СтрокаАутентификации = "";
    Иначе
        
        Если СтрНайти(ПараметрыПодключения.ИмяПользователя, """") Тогда
            ПараметрыПодключения.ИмяПользователя = СтрЗаменить(ПараметрыПодключения.ИмяПользователя, """", """""");
        КонецЕсли;
        
        Если СтрНайти(ПараметрыПодключения.ПарольПользователя, """") Тогда
            ПараметрыПодключения.ПарольПользователя = СтрЗаменить(ПараметрыПодключения.ПарольПользователя, """", """""");
        КонецЕсли;
        
        СтрокаАутентификации = "; Usr = ""&ИмяПользователя""; Pwd = ""&ПарольПользователя""";
        СтрокаАутентификации = СтрЗаменить(СтрокаАутентификации, "&ИмяПользователя",    ПараметрыПодключения.ИмяПользователя);
        СтрокаАутентификации = СтрЗаменить(СтрокаАутентификации, "&ПарольПользователя", ПараметрыПодключения.ПарольПользователя);
    КонецЕсли;
    
    СтрокаСоединения = СтрЗаменить(ШаблонСтрокиСоединения, "[СтрокаБазы]", СтрокаБазы);
    СтрокаСоединения = СтрЗаменить(СтрокаСоединения, "[СтрокаАутентификации]", СтрокаАутентификации);
    
    Попытка
        Соединение = COMОбъект.Connect(СтрокаСоединения);
    Исключение
        Лог.Ошибка("Не удалось подключиться к ИБ по причине: " + ОписаниеОшибки());
		КодВозврата = 27;
        Возврат Неопределено;
    КонецПопытки;
    
    Возврат Соединение;
    
КонецФункции

// Возвращает строку для подключения к внешней базе по переданным параметрам подключения. 
// Параметры:
//  ПараметрыПодключения - Структура - параметры для установки внешнего соединения с информационной базой (см. УстановитьВнешнееСоединениеСБазой()). 
// Возвращаемое значение:
//  Строка, Неопределено - строка подключения или Неопределено в случае ошибки;
//
Функция ПолучитьСтрокуСоединения(знач ПараметрыПодключения)  
    
    ФайловыйВариантРаботы = ПараметрыПодключения.ВариантРаботыИнформационнойБазы = 0;
    
    // Формирование строки соединения.
    СтрокаСоединения = "[СтрокаБазы][СтрокаАутентификации]";
    
    Если ФайловыйВариантРаботы Тогда
        СтрокаБазы = " /F""&КаталогИнформационнойБазы""";
        СтрокаБазы = СтрЗаменить(СтрокаБазы, "&КаталогИнформационнойБазы", ПараметрыПодключения.КаталогИнформационнойБазы);
    Иначе
        СтрокаБазы = " /S""&ИмяСервера1СПредприятия/&ИмяИнформационнойБазыНаСервере1СПредприятия""";
        СтрокаБазы = СтрЗаменить(СтрокаБазы, "&ИмяСервера1СПредприятия",                     ПараметрыПодключения.ИмяСервера1СПредприятия);
        СтрокаБазы = СтрЗаменить(СтрокаБазы, "&ИмяИнформационнойБазыНаСервере1СПредприятия", ПараметрыПодключения.ИмяИнформационнойБазыНаСервере1СПредприятия);
    КонецЕсли;
    
    Если ПараметрыПодключения.АутентификацияОперационнойСистемы Тогда
        СтрокаАутентификации = "";
    Иначе
        
        Если СтрНайти(ПараметрыПодключения.ИмяПользователя, """") Тогда
            ПараметрыПодключения.ИмяПользователя = СтрЗаменить(ПараметрыПодключения.ИмяПользователя, """", """""");
        КонецЕсли;
        
        Если СтрНайти(ПараметрыПодключения.ПарольПользователя, """") Тогда
            ПараметрыПодключения.ПарольПользователя = СтрЗаменить(ПараметрыПодключения.ПарольПользователя, """", """""");
        КонецЕсли;
        
        СтрокаАутентификации = " /N""&ИмяПользователя"" /P""&ПарольПользователя""";
        СтрокаАутентификации = СтрЗаменить(СтрокаАутентификации, "&ИмяПользователя",    ПараметрыПодключения.ИмяПользователя);
        СтрокаАутентификации = СтрЗаменить(СтрокаАутентификации, "&ПарольПользователя", ПараметрыПодключения.ПарольПользователя);
    КонецЕсли;
    
    СтрокаСоединения = СтрЗаменить(СтрокаСоединения, "[СтрокаБазы]", СтрокаБазы);
    СтрокаСоединения = СтрЗаменить(СтрокаСоединения, "[СтрокаАутентификации]", СтрокаАутентификации);
    
    Возврат СтрокаСоединения;
    
КонецФункции

// oscript $(FULL_CURRENT_PATH) /CopyFTP /UPath d:\_Проекты\Uni_Script\Примеры\1.txt /UServer bitrix122.timeweb.ru /N diversus /P *** /UPathFTP /softonit.ru/public_html/test/
Процедура КопироватьНаFTP()	
	
	// Проверка параметров
	Если ЗначениеЗаполнено(Параметры["/UPath"]) Тогда
		мИмяФайла = Параметры["/UPath"];		
	Иначе
		Лог.Ошибка("Не заполнен параметр ""/UPath"" - путь к файлу для копирования по FTP!");
		КодВозврата = 28;
		Возврат;
	КонецЕсли;

	Файл = Новый Файл(мИмяФайла);
	Если Не Файл.Существует() Тогда		
		Лог.Ошибка("Файл """ + мИмяФайла + """" + " не существует для копирования по FTP.");
		КодВозврата = 29;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры["/N"]) Тогда
		мИмяПользователя = Параметры["/N"];		
	Иначе
		Лог.Ошибка("Не заполнен параметр ""/N"" - имя пользователя для копирования по FTP!");
		КодВозврата = 30;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры["/P"]) Тогда
		мПароль = Параметры["/P"];		
	Иначе
		Лог.Ошибка("Не заполнен параметр ""/P"" - пароль для копирования по FTP!");
		КодВозврата = 31;
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры["/UServer"]) Тогда
		мСервер = Параметры["/UServer"];		
	Иначе
		Лог.Ошибка("Не заполнен параметр ""/P"" - пароль для копирования по FTP!");
		КодВозврата = 32;
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры["/UPathFTP"]) Тогда
		мПутьНаСервере = Параметры["/UPathFTP"];		
	Иначе
		Лог.Ошибка("Не заполнен параметр ""/UPathFTP"" - путь на сервере FTP куда необходимо скопировать файл!");
		КодВозврата = 33;
		Возврат;
	КонецЕсли;
	
	Лог.Информация("Передача файла по FTP");
	мСтрока = "ftp://" + мИмяПользователя + ":" + мПароль + "@" + мСервер + "/" + мПутьНаСервере + "/";
	Попытка
		objShell = Новый COMОбъект("Shell.Application");
		objFolder = objShell.NameSpace(мСтрока);
		а = objFolder.CopyHere(мИмяФайла);
		Лог.Информация("Завершение передачи файла по FTP");
	Исключение
		Лог.Ошибка("Ошибка передачи файла по FTP: " + ОписаниеОшибки());
		КодВозврата = 34;
	КонецПопытки	
	
КонецПроцедуры

// Разбивает строку на несколько строк по разделителю. Разделитель может иметь любую длину.
Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено, СокращатьНепечатаемыеСимволы = Ложь) Экспорт
	
	Результат = Новый Массив;
	
	// для обеспечения обратной совместимости
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Строка) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	//
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Если СокращатьНепечатаемыеСимволы Тогда
				Результат.Добавить(СокрЛП(Подстрока));
			Иначе
				Результат.Добавить(Подстрока);
			КонецЕсли;
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
		Если СокращатьНепечатаемыеСимволы Тогда
			Результат.Добавить(СокрЛП(Строка));
		Иначе
			Результат.Добавить(Строка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает информацию о конфигурации (версия, имя, синоним)
Функция ИнформацияОКонфигурации()
	
	ИмяCOMСоединителя = "V83.ComConnector";
	Попытка
		COMОбъект = Новый COMОбъект(ИмяCOMСоединителя);
	Исключение
		Лог.Ошибка("Не удалось подключиться через " + ИмяCOMСоединителя + " по причине: " + ОписаниеОшибки());
		КодВозврата = 36;
		Возврат Неопределено;
	КонецПопытки;	
	
	Лог.Информация("Получаем информацию о конфигурации");
	
	Попытка
		Соединение 				= COMОбъект.Connect(Параметры["СтрокаПодключения"]);
		ВерсияКонфигурации 		= Соединение.Метаданные().Версия;
		ИмяКонфигурации 		= Соединение.Метаданные().Имя;
		СинонимКонфигурации 	= Соединение.Метаданные().Синоним;
		Поставщик 				= Соединение.Метаданные().Поставщик;		
		Лог.Информация("Информация получена");
	Исключение
		Лог.Ошибка("Не удалось получить данные конфигурации через " + ИмяCOMСоединителя + " по причине: " + ОписаниеОшибки());
		КодВозврата = 37;
		Возврат Неопределено;
	КонецПопытки;
	
	Если ПустаяСтрока(ВерсияКонфигурации) Тогда
		Лог.Ошибка("Текущая версия конфигурации не получена. Нельзя продолжить.");
		КодВозврата = 38;
		Возврат Неопределено;		
	КонецЕсли;

	// Очищаем соединения
	Если Соединение <> Неопределено Тогда
		Попытка
			ОсвободитьОбъект(Соединение);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если COMОбъект <> Неопределено Тогда
		Попытка
			ОсвободитьОбъект(COMОбъект);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ВыполнитьСборкуМусора();	
	
	Возврат Новый Структура("ВерсияКонфигурации, ИмяКонфигурации, СинонимКонфигурации, Поставщик", ВерсияКонфигурации, ИмяКонфигурации, СинонимКонфигурации, Поставщик)
	
КонецФункции

Функция ВыполнитьПрограммноеОбновлениеКонфигурации()
	
	// ШАГ 3. Подключаемся по COM
	ИмяCOMСоединителя = "V83.ComConnector";
	Попытка
		COMОбъект = Новый COMОбъект(ИмяCOMСоединителя);
	Исключение
		Лог.Ошибка("Не удалось подключиться через " + ИмяCOMСоединителя + " по причине: " + ОписаниеОшибки());
		КодВозврата = 40;
		Возврат Неопределено;
	КонецПопытки;	
			
	Попытка
		Соединение 				= COMОбъект.Connect(Параметры["СтрокаПодключения"]);
		мВерсияКонфигурации 	= Соединение.Метаданные().Версия;
		мИмяКонфигурации 		= Соединение.Метаданные().Имя;
		мСинонимКонфигурации 	= Соединение.Метаданные().Синоним;			
		Лог.Информация("Текущая версия конфигурации для релиза " + мВерсияКонфигурации);
	Исключение
		Лог.Ошибка("Не удалось получить данные конфигурации через " + ИмяCOMСоединителя + " по причине: " + ОписаниеОшибки());
		КодВозврата = 41;
		Возврат Неопределено;
	КонецПопытки;
	
	Если ПустаяСтрока(мВерсияКонфигурации) Тогда
		Лог.Ошибка("Текущая версия конфигурации не получена. Нельзя продолжить.");
		КодВозврата = 42;
		Возврат Неопределено;		
	КонецЕсли;
	
	// ШАГ 3. Запуск конфигурации в режиме предприятия с проверкой легальности
	Если ЗначениеЗаполнено(Параметры["/Legal"]) Тогда
		
		Лог.Информация("Принятие обновления.");		
		
		Попытка
			Соединение.ОбновлениеИнформационнойБазыСлужебный.ЗаписатьПодтверждениеЛегальностиПолученияОбновлений();
			Соединение.ОбновлениеИнформационнойБазы.ВыполнитьОбновлениеИнформационнойБазы(Ложь);			
			Лог.Информация("Принятие обновления завершено.");
		Исключение
			Лог.Ошибка("Не удалось принять обновление по причине: " + ОписаниеОшибки());
			КодВозврата = 43;
		КонецПопытки;
		
	КонецЕсли;

	// Очищаем соединения
	Если Соединение <> Неопределено Тогда
		Попытка
			ОсвободитьОбъект(Соединение);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если COMОбъект <> Неопределено Тогда
		Попытка
			ОсвободитьОбъект(COMОбъект);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ВыполнитьСборкуМусора();	
	
	Возврат Новый Структура("мВерсияКонфигурации, мИмяКонфигурации, мСинонимКонфигурации", мВерсияКонфигурации, мИмяКонфигурации, мСинонимКонфигурации)
	
КонецФункции

// oscript $(FULL_CURRENT_PATH) /BuildDistribRepo /F "D:\_Проекты\Управление IT-отделом 8 УФ\Пустая конфигурация для обновления" /N "Администратор" /P "" /ConfigurationRepositoryF "D:\Хранилище\Управление IT-отделом 8" /ConfigurationRepositoryN "Обновления" /Legal "Yes" /UPath "d:\_Проекты\Управление IT-отделом 8 УФ\Полные комплекты и обновления" /NVer "3.0.27.6" /NeedVerPL "8.3.6"
Процедура СоздатьДистрибутивИзХранилища()	
	
	// Шаг 0. Проверка заполненных параметров
	мКаталогСборки = Параметры["/UPath"];
	Если НЕ ЗначениеЗаполнено(Параметры["/ConfigurationRepositoryF"]) Тогда
		Лог.Ошибка("Не заполнен параметр ""/ConfigurationRepositoryF"" - путь к хранилищу!");
		КодВозврата = 44;
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Параметры["/ConfigurationRepositoryN"]) Тогда
		Лог.Ошибка("Не заполнен параметр ""/ConfigurationRepositoryN"" - пользователь хранилища!");
		КодВозврата = 45;
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(мКаталогСборки) Тогда
		Лог.Ошибка("Не заполнен параметр ""/UPath"" - каталог сборки (где будет создан дистрибутив)!");
		КодВозврата = 46;
		Возврат;
	Иначе
		Файл = Новый Файл(мКаталогСборки);
		Если Не Файл.Существует() Тогда		
			Лог.Ошибка("Каталог """ + мКаталогСборки + """" + " не существует для создания дистрибутива.");
			КодВозврата = 47;
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	мКаталогСборки = ДополнитьСтрокуСлешем(мКаталогСборки);
	
	// Шаг 1. Загружаем все изменения из хранилища
	НомерШага = 1;
	ПараметрыЗапуска1 			= Конфигуратор.ПолучитьПараметрыЗапуска();
	ПараметрыЗапуска1.Добавить("/ConfigurationRepositoryUpdateCfg -revised -force");
	ПараметрыЗапуска1.Добавить("/ConfigurationRepositoryF """ + Параметры["/ConfigurationRepositoryF"] + """");	
	ПараметрыЗапуска1.Добавить("/ConfigurationRepositoryN """ + Параметры["/ConfigurationRepositoryN"] + """");
	Если ЗначениеЗаполнено(Параметры["/ConfigurationRepositoryP"]) Тогда
		ПараметрыЗапуска1.Добавить("/ConfigurationRepositoryP """ + Параметры["/ConfigurationRepositoryP"] + """");
	КонецЕсли;
		
	Лог.Информация("ШАГ " + Строка(НомерШага)); 
	Лог.Информация("Получаем конфигурацию из хранилища");
	Попытка
	    Конфигуратор.ВыполнитьКоманду(ПараметрыЗапуска1);
		Лог.Информация("Получение завершено");
	Исключение												   
		Лог.Ошибка("Произошла ошибка при получении конфигурации из хранилища " + Конфигуратор.ВыводКоманды());		
		КодВозврата = 48;
		Возврат;
	КонецПопытки;
	НомерШага = НомерШага + 1;
	
	// Шаг 2. Обновляем конфигурацию
	ПараметрыЗапуска2 			= Конфигуратор.ПолучитьПараметрыЗапуска();
	ПараметрыЗапуска2.Добавить("/UpdateDBCfg");
	
	Лог.Информация("ШАГ " + Строка(НомерШага));
	Лог.Информация("Обновление конфигурации базы данных");
	Попытка
	    Конфигуратор.ВыполнитьКоманду(ПараметрыЗапуска2);
		Лог.Информация("Обновление конфигурации завершено");
	Исключение												   
		Лог.Ошибка("Произошла ошибка при обновлении конфигурации базы данных " + Конфигуратор.ВыводКоманды());
		КодВозврата = 49;
		Возврат;
	КонецПопытки;
	НомерШага = НомерШага + 1;

	// Обновляем при необходимости
	Результат = ВыполнитьПрограммноеОбновлениеКонфигурации();
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	мВерсияКонфигурации 	= Результат.мВерсияКонфигурации;
	мИмяКонфигурации 		= Результат.мИмяКонфигурации;
	мСинонимКонфигурации 	= Результат.мСинонимКонфигурации;	
	ВыполнитьСборкуМусора();
	
	// ШАГ 4. Создаем папки и будущую навигацию
	Лог.Информация("ШАГ " + Строка(НомерШага));
	Лог.Информация("Создание каталогов и заполнение вспомогательных данных.");
	мВерсииОбновлений = Параметры["/NVer"];
	мМассивВерсий = РазложитьСтрокуВМассивПодстрок(мВерсииОбновлений);
	
	мКаталогВерсии 						= ДополнитьСтрокуСлешем(мКаталогСборки + мВерсияКонфигурации);
	мКаталогВерсииПолный 				= ДополнитьСтрокуСлешем(мКаталогВерсии + "Полный");
	мКаталогВерсииОбновление 			= ДополнитьСтрокуСлешем(мКаталогВерсии + "Обновление");
	мКаталогВерсииДополнительныеФайлы 	= ДополнитьСтрокуСлешем(мКаталогВерсии + "Дополнительные файлы");
	
	Файл = Новый Файл(мКаталогСборки);
	// Удаляем все файлы в папке сборки, если она есть
	Если Файл.Существует() Тогда
		Попытка
			УдалитьФайлы(мКаталогВерсии);
		Исключение
			Лог.Ошибка("Не удалось удалить каталог со старой версией, для новой сборки: " + ОписаниеОшибки());
			КодВозврата = 50;
			Возврат;
		КонецПопытки;
	КонецЕсли;

	// Создаем каталоги
	СоздатьКаталог(мКаталогВерсии);
	СоздатьКаталог(мКаталогВерсииПолный);	
	СоздатьКаталог(мКаталогВерсииДополнительныеФайлы);
	
	// Нужно делать и обновление
	мСтрокаСВерсиями = "";
	Если мМассивВерсий.Количество() > 0 Тогда
		СоздатьКаталог(мКаталогВерсииОбновление);
		// Создаем UpdInfo.txt
		ТД = Новый ТекстовыйДокумент;
		ТекстВерсий = "Version=" + мВерсияКонфигурации + Символы.ПС + "FromVersions=;";
		Для Каждого мВерсия Из мМассивВерсий Цикл
			ТекстВерсий = ТекстВерсий + мВерсия + ";";
			Если НЕ ПустаяСтрока(мСтрокаСВерсиями) Тогда
				мСтрокаСВерсиями = мСтрокаСВерсиями + ", ";
			КонецЕсли;
			мСтрокаСВерсиями = мСтрокаСВерсиями + мВерсия;
		КонецЦикла;
		ТекстВерсий = ТекстВерсий + Символы.ПС + "UpdateDate=" + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
		ТД.УстановитьТекст(ТекстВерсий);
		ТД.Записать(мКаталогВерсииДополнительныеФайлы + "UpdInfo.txt");
	КонецЕсли;
	
	// Создаем ReadMe.txt
	ТД = Новый ТекстовыйДокумент;
	Текст = "Конфигурация """ + мСинонимКонфигурации + """" + Символы.ПС + 
		"Версия " + мВерсияКонфигурации + Символы.ПС +
		"=================================================================" + Символы.ПС + Символы.ПС +		
		"Внимание!"+ Символы.ПС +
		"Текущая версия конфигурации """ + мСинонимКонфигурации + """ предназначена"+ Символы.ПС +
		"для использования с версией системы 1С:Предприятие 8.3 не ниже " + Параметры["/NeedVerPL"];
	ТД.УстановитьТекст(Текст);
	ТД.Записать(мКаталогВерсииДополнительныеФайлы + "ReadMe.txt");
	
	ПолучитьОписаниеОбновленияИзМакета(мКаталогСборки + "news.html");
	ВыполнитьСборкуМусора();
	
	// Создаем 1cv8upd.htm
	ТД = Новый ТекстовыйДокумент;
	мТекстНовостей = "";
	Файл = Новый Файл(мКаталогСборки);
	Если Файл.Существует() Тогда			
		ТД.Прочитать(мКаталогСборки + "news.html");
		мТекстНовостей = ТД.ПолучитьТекст();
	КонецЕсли;	
	Текст = "<HTML><HEAD>
			|<META http-equiv=Content-Type content=""text/html; charset=utf-8""><LINK href=""__STYLE__"" type=text/css rel=stylesheet><BASE href=v8config://1F802B99-D580-4E0F-93A3-F3F36B54052D/mdobject/id85895E9C-8000-4F0E-8DFD-B67B5FE6CC6C/8EB4FAD1-1FA6-403E-970F-2C12DBB43E23>
			|<META content=""MSHTML 6.00.2900.5969"" name=GENERATOR></HEAD>
			|<style type=""text/css"">
			|.updnew li:before{color:#090;content:""[+] "";font-family:""Courier New"",Courier,monospace;font-weight:bold;font-style:normal;list-style:none;}
			|.updedt li:before{color:#005EF9;content:""[*] "";font-family:""Courier New"",Courier,monospace;font-weight:bold;font-style:normal;list-style:none;}
			|.upderr li:before{color:#FF0000;content:""[-] "";font-family:""Courier New"",Courier,monospace;font-weight:bold;font-style:normal;list-style:none;}
			|.updnws li:before{color:#810A0A;content:""[#] "";font-family:""Courier New"",Courier,monospace;font-weight:bold;font-style:normal;list-style:none;}
			|</style>
			|<BODY>
			|<TABLE style=""BORDER-RIGHT: black 1px solid; BORDER-TOP: black 1px solid; BORDER-LEFT: black 1px solid; BORDER-BOTTOM: black 1px solid"" cellSpacing=0 cellPadding=8 width=""100%"" bgColor=#ffffd6 border=0>
			|<TBODY>
			|<TR>
			|<TD>
			|<H2><FONT face=Tahoma color=#c10000>Конфигурация<BR>" + мСинонимКонфигурации + "</FONT></FONT></H2></TD></TR></TBODY></TABLE>
			|<H3 style=""BORDER-BOTTOM: #c10000 2px solid""><FONT face=Arial color=#c10000 size=5><EM>Версия&nbsp;" + мВерсияКонфигурации + "</EM></FONT></H3>
			|<H4><FONT face=Verdana color=#823602>Порядок обновления всех конфигураций</FONT></H4>
			|<OL>
			|<LI>Запустите систему 1С:Предприятие в режиме ""Конфигуратор"".
			|<LI><B>Обязательно сделайте архивную копию вашей информационной базы!</B> Для этого надо в меню Администрирование выбрать пункт ""Выгрузить информационную базу"" и ввести имя файла выгрузки. Этот файл надо сохранить в надёжном месте.
			|<LI>В режиме ""Конфигуратор"" откройте конфигурацию, для этого в меню ""Конфигурация"" выберите пункт ""Открыть конфигурацию"".
			|<LI>Вызовите режим ""Обновление конфигураций"", для этого в меню ""Конфигурация"", подменю ""Поддержка"", выберите пункт ""Обновить конфигурацию"".
			|<LI>В диалоге выбора обновления в качестве источника обновления укажите ""Доступные обновления"", после чего выберите нужное обновление в соответствующем списке.
			|<LI>Если в списке обновлений необходимое обновление отсутствует, то в диалоге выбора обновления в качестве источника обновления укажите ""Файл обновления"", после чего выберите нужный файл обновления (по умолчанию 1cv8.cfu).
			|<LI>В окне ""Обновление конфигураций"" нажмите кнопку ""OK"" для продолжения обновления конфигурации.
			|<LI>На вопрос об обновлении конфигурации базы данных ответьте ""ДА"".
			|<LI>После завершения <B>обязательно</B> запустите программу в режиме ""Предприятие"" - для совершения конвертации. Некоторые пользователи не выходя из конфигуратора последовательно обновляют версии - это недопустимо и повлечет за собой невозможность дальнейшей работы. После каждого обновления надо хотя бы 1 раз запускать 1С в режиме 1С:Предприятие.</LI></OL>
			|<H4><FONT face=Verdana color=#823602>Порядок обновления конфигурации версий " + мСтрокаСВерсиями + " на версию " + мВерсияКонфигурации + "</FONT></H4>
			|<P>Для обновления версии конфигурации следует использовать режим ""Обновление конфигураций"". Файл обновлений 1Cv8.cfu находится в каталоге шаблонов (по умолчанию - подкаталог tmplts\ каталога установки 1С:Предприятия 8), в подкаталоге SoftOnIT\it3\" + СтрЗаменить(мВерсияКонфигурации, ".", "_") + "\</P>
			|</SPAN><hr><font color=""#ff0000"">Внимание!<br>Текущая версия конфигурации """ + мСинонимКонфигурации + """ предназначена для использования с версией системы 1С:Предприятие 8.3 не ниже " + Параметры["/NeedVerPL"] + ".</font><hr>" + 
			мТекстНовостей + "
			|</BODY></HTML>";
	ТД.УстановитьТекст(Текст);
	ТД.Записать(мКаталогВерсииДополнительныеФайлы + "1cv8upd.htm");		
	
	НомерШага = НомерШага + 1;
	
	ВыполнитьСборкуМусора();
	
	// ШАГ 5. Создаем файл поставки
	ПараметрыЗапуска3 			= Конфигуратор.ПолучитьПараметрыЗапуска();
	ПараметрыЗапуска3.Добавить("/CreateDistributionFiles");
	// Создаем полный дистрибутив
	ПараметрыЗапуска3.Добавить("-cffile """ + мКаталогВерсии + "1Cv8.cf" + """");
	Если мМассивВерсий.Количество() > 0 Тогда
		// Добавляем обновления для каждой из версии
		ПараметрыЗапуска3.Добавить("-cfufile """ + мКаталогВерсии + "1Cv8.cfu" + """");
		Для Каждого мВерсия Из мМассивВерсий Цикл
			ПараметрыЗапуска3.Добавить("-v" + мВерсия);
		КонецЦикла;
	КонецЕсли;

	Лог.Информация("ШАГ " + Строка(НомерШага));
	Лог.Информация("Создание файла поставки");
	Попытка
		Конфигуратор.ВыполнитьКоманду(ПараметрыЗапуска3);
		Лог.Информация("Создание файла поставки завершено");
	Исключение												   
		Лог.Ошибка("Произошла ошибка при создании файла поставки " + Конфигуратор.ВыводКоманды());
		КодВозврата = 51;
		Возврат;
	КонецПопытки;
	НомерШага = НомерШага + 1;
	
	// ШАГ 6. Создание дистрибутива
	ПараметрыЗапуска4 			= Конфигуратор.ПолучитьПараметрыЗапуска();
	ПараметрыЗапуска4.Добавить("/CreateDistributive """ + мКаталогВерсииПолный + """");
	ПараметрыЗапуска4.Добавить("-File """ + мКаталогСборки + "install.edf" + """");
	ПараметрыЗапуска4.Добавить("-MakeSetup");	
	
	Лог.Информация("ШАГ " + Строка(НомерШага));
	Лог.Информация("Создание дистрибутива");
	Попытка
		Конфигуратор.ВыполнитьКоманду(ПараметрыЗапуска4);
		Лог.Информация("Создание дистрибутива завершено");
		
		// Делаем архив
		ЗаписьZIP =  Новый ЗаписьZipФайла(мКаталогВерсииПолный + "full.zip");     
		ЗаписьZIP.Добавить(мКаталогВерсииПолный + "*.*",
			РежимСохраненияПутейZIP.СохранятьОтносительныеПути,
			РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);		
		ЗаписьZIP.Записать();
		Лог.Информация("Создание архива дистрибутива завершено");
		
	Исключение												   
		Лог.Ошибка("Произошла ошибка при создании дистрибутива " + Конфигуратор.ВыводКоманды());
		КодВозврата = 52;
		Возврат;
	КонецПопытки;
	НомерШага = НомерШага + 1;
	
	// ШАГ 7. Создание обновления
	Если мМассивВерсий.Количество() > 0 Тогда
		ПараметрыЗапуска5 			= Конфигуратор.ПолучитьПараметрыЗапуска();
		ПараметрыЗапуска5.Добавить("/CreateDistributive """ + мКаталогВерсииОбновление + """");
		ПараметрыЗапуска5.Добавить("-File """ + мКаталогСборки + "install.edf" + """");
		ПараметрыЗапуска5.Добавить("-Option Обновление");
		ПараметрыЗапуска5.Добавить("-MakeSetup");

		Лог.Информация("ШАГ " + Строка(НомерШага));
		Лог.Информация("Создание обновления дистрибутива");
		Попытка
			Конфигуратор.ВыполнитьКоманду(ПараметрыЗапуска5);
			Лог.Информация("Создание обновления дистрибутива завершено");
			
			// Делаем архив
			ЗаписьZIP =  Новый ЗаписьZipФайла(мКаталогВерсииОбновление + мВерсияКонфигурации + ".zip");     
			ЗаписьZIP.Добавить(мКаталогВерсииОбновление + "*.*",
				РежимСохраненияПутейZIP.СохранятьОтносительныеПути,
				РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
			ЗаписьZIP.Записать();
			Лог.Информация("Создание архива обновления дистрибутива завершено");			
		Исключение												   
			Лог.Ошибка("Произошла ошибка при создании обновления дистрибутива " + Конфигуратор.ВыводКоманды());
			КодВозврата = 53;
			Возврат;
		КонецПопытки;
		НомерШага = НомерШага + 1;
			
	КонецЕсли;
	
	Лог.Информация("Успешное завершение сборки.");
	
КонецПроцедуры

//	oscript $(FULL_CURRENT_PATH) /SaveLastConfigUpdateText /F "D:\_Проекты\Управление IT-отделом 8 УФ\Пустая конфигурация для обновления" /N "Администратор" /P "" /UPath "d:\_Проекты\Управление IT-отделом 8 УФ\Полные комплекты и обновления\news.html" /Maket "ОписаниеИзмененийСистемы"
Процедура ПолучитьОписаниеОбновленияИзМакета(ФайлHTML = Неопределено)
		
	мФайлHTML = "";
	Если ФайлHTML = Неопределено Тогда
	
		Если НЕ ЗначениеЗаполнено(Параметры["/UPath"]) Тогда
			Лог.Ошибка("Не заполнен параметр ""/UPath"" - путь к HTML документу с описанием изменений!");
			КодВозврата = 54;
			Возврат;
		КонецЕсли;
		мФайлHTML = Параметры["/UPath"];
		
	Иначе
	
		мФайлHTML = ФайлHTML;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметры["/Maket"]) Тогда
		ИмяМакета = "ОписаниеИзмененийСистемы";
	Иначе
		ИмяМакета = Параметры["/Maket"];
	КонецЕсли;
	
	ИмяCOMСоединителя = "V83.ComConnector";
	Попытка
		COMОбъект = Новый COMОбъект(ИмяCOMСоединителя);
	Исключение
		Лог.Ошибка("Не удалось подключиться через " + ИмяCOMСоединителя + " по причине: " + ОписаниеОшибки());
		КодВозврата = 55;
		Возврат;
	КонецПопытки;	
			
	Попытка
		Соединение 				= COMОбъект.Connect(Параметры["СтрокаПодключения"]);
		мВерсияКонфигурации 	= Соединение.Метаданные().Версия;
		
		// Получаем текстовый файл описания
		Макет = Соединение.ПолучитьОбщийМакет(ИмяМакета);//"ОписаниеИзмененийСистемы");
		
		Обновление = Новый ТаблицаЗначений;
		Обновление.Колонки.Добавить("Раздел");
		Обновление.Колонки.Добавить("Текст");
		Обновление.Колонки.Добавить("ТекстHTML");
		Обновление.Колонки.Добавить("ЦветТекста");
		
		ТД = Новый ТекстовыйДокумент;
		Текст = "";
		ТекстHTML = "";
		Области = Макет.ПолучитьОбласть("Версия" + СтрЗаменить(мВерсияКонфигурации, ".", "_"));
		Раздел = "Новый функционал";
		Для а = 1 по Области.ВысотаТаблицы Цикл
		
			Текст 		= Области.Область(а, 2, а, 2).Текст;
			ЦветТекста 	= Области.Область(а, 2, а, 2).ЦветТекста;
			Если ПустаяСтрока(Текст) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Текст = "Новый функционал" 
				ИЛИ Текст = "Изменения" 
				ИЛИ Текст = "Исправление ошибок" 
				ИЛИ Текст = "Внимание!" 
				ИЛИ Текст = "Новости"
				ИЛИ Текст = "Замечания к обновлению" Тогда
				Раздел = Текст;
				Продолжить;
			КонецЕсли;
				
			// Удаляем теги
			ТекстHTML = СтрЗаменить(Текст, "&", "&amp;");
			ТекстHTML = СтрЗаменить(ТекстHTML, "<", "&lt;");
			ТекстHTML = СтрЗаменить(ТекстHTML, ">", "&gt;");
			ТекстHTML = СтрЗаменить(ТекстHTML, Символы.ПС, "<br />");
			
			Текст = СтрЗаменить(Текст, Символы.ПС, " ");
			Пока Найти(Текст, "  ") > 0 Цикл
				Текст = СтрЗаменить(Текст, "  ", " ");
			КонецЦикла;			
			Текст = СокрЛП(Текст);
			
			// Это гиперссылка
			Если Области.Область(а, 2, а, 2).Гиперссылка = Истина Тогда
				ТекстHTML = "<a href=""" + Области.Область(а, 2, а, 2).Имя + """ target=""_blank"">" + ТекстHTML + "</a>";
				Текст = "[url=" + Области.Область(а, 2, а, 2).Имя + "]" + Текст + "[/url]";
			КонецЕсли;
			
			Если Области.Область(а, 2, а, 2).Отступ = 0 ИЛИ Обновление.Количество() = 0 Тогда
				Стр 			= Обновление.Добавить();
				Стр.Раздел 		= Раздел;			
				Стр.ТекстHTML 	= ТекстHTML;
				Стр.Текст	  	= Текст;
			Иначе
				Стр 			= Обновление.Получить(Обновление.Количество() - 1);
				Стр.ТекстHTML 	= Стр.ТекстHTML + "<br />" + Символы.ПС;
				Стр.Текст	  	= Стр.Текст + Символы.ПС;
				Для ИндексОтступов = 1 По Области.Область(а, 2, а, 2).Отступ Цикл
					Стр.ТекстHTML 	= Стр.ТекстHTML + "&nbsp;";
					Стр.Текст	  	= Стр.Текст + " ";
				КонецЦикла;
				Стр.ТекстHTML 	= Стр.ТекстHTML + ТекстHTML;
				Стр.Текст	  	= Стр.Текст + Текст;
			КонецЕсли;
			Стр.ЦветТекста 		= ЦветТекста;

		КонецЦикла;
		
		Раздел = "";
		ТекстHTML = "";
		Для Каждого Строки Из Обновление Цикл
			Если Раздел <> Строки.Раздел Тогда
				Если НЕ ПустаяСтрока(ТекстHTML) тогда
					ТекстHTML = ТекстHTML + "</ul>" + Символы.ПС;
				КонецЕсли;
				ТекстHTML = ТекстHTML + "<h4>" + Строки.Раздел + "</h4>" + Символы.ПС;
				Раздел = Строки.Раздел;
				КлассCSS = "";
				Если Раздел = "Новый функционал" Тогда
					КлассCSS = "updnew";
				ИначеЕсли Раздел = "Изменения" Тогда
					КлассCSS = "updedt";
				ИначеЕсли Раздел = "Исправление ошибок" Тогда
					КлассCSS = "upderr";
				ИначеЕсли Раздел = "Внимание!" ИЛИ Раздел = "Новости" Тогда
					КлассCSS = "updnws";
				ИначеЕсли Раздел = "Замечания к обновлению" Тогда
					КлассCSS = "upderr";
				КонецЕсли;
				ТекстHTML = ТекстHTML + "<ul class=""" + КлассCSS + """>" + Символы.ПС;
			КонецЕсли;
			Префикс 		= "";
			Постфикс 		= "";
			Если Строки.ЦветТекста.Зеленый <> -1 И Строки.ЦветТекста.Красный <> -1 И Строки.ЦветТекста.Синий <> -1 И Найти(Строки.ТекстHTML, "<a href=") = 0 Тогда
				Префикс 	= Префикс  + "<span style=""color:rgb(" + Строка(Строки.ЦветТекста.Красный) + "," + Строка(Строки.ЦветТекста.Зеленый) + "," + Строка(Строки.ЦветТекста.Синий) + ");"">";
				Постфикс 	= Постфикс + "</span>";
			КонецЕсли;
			
			ТекстHTML = ТекстHTML + "<li>" + Префикс + Строки.ТекстHTML + Постфикс + "</li>" + Символы.ПС;
		КонецЦикла;
		ТекстHTML = ТекстHTML + "</ul>" + Символы.ПС;
		
		Раздел = "";
		Текст = "";
		КлассCSS = "";
		Для Каждого Строки Из Обновление Цикл
			Если Раздел <> Строки.Раздел Тогда
				Раздел = Строки.Раздел;
				КлассCSS = "";
				Если Раздел = "Новый функционал" Тогда
					КлассCSS = "[+] ";
				ИначеЕсли Раздел = "Изменения" Тогда
					КлассCSS = "[*] ";
				ИначеЕсли Раздел = "Исправление ошибок" Тогда
					КлассCSS = "[-] ";
				ИначеЕсли Раздел = "Внимание!" ИЛИ Раздел = "Новости" Тогда
					КлассCSS = "[#] ";
				КонецЕсли;
			КонецЕсли;

			Префикс 		= "";
			Постфикс 		= "";
			Если Строки.ЦветТекста.Зеленый <> -1 И Строки.ЦветТекста.Красный <> -1 И Строки.ЦветТекста.Синий <> -1 И Найти(Строки.Текст, "[url=") = 0  Тогда
				Префикс 	= Префикс  + "[color=rgb(" + Строка(Строки.ЦветТекста.Красный) + "," + Строка(Строки.ЦветТекста.Зеленый) + "," + Строка(Строки.ЦветТекста.Синий) + ")]";
				Постфикс 	= Постфикс + "[/color]";
			КонецЕсли;			
			
			Текст = Текст + КлассCSS + Префикс + Строки.Текст + Постфикс + Символы.ПС;
		КонецЦикла;

		ТД = Новый ТекстовыйДокумент;
		
		Если Найти(НРег(мФайлHTML), ".html") > 0 ИЛИ Найти(НРег(мФайлHTML), ".htm") > 0 Тогда
			ТекстНеОбработанный = ТекстHTML;
		Иначе
			ТекстНеОбработанный = Текст;
		КонецЕсли;
		
		// ПРЕОБРАЗУЕМ URLS, должен находится рядом с файлом
		Файл = Новый Файл(мФайлHTML);
		ИмяURL = Файл.Путь + "urls.txt";
		Файл = Новый Файл(ИмяURL);
		Если Файл.Существует() Тогда
			ФайлURL = Новый ТекстовыйДокумент;
			ФайлURL.Прочитать(ИмяURL);
			ТекстURL = ФайлURL.ПолучитьТекст();	
		
			Для Индекс = 1 По СтрЧислоСтрок(ТекстURL) Цикл
				Стр = СтрПолучитьСтроку(ТекстURL, Индекс);
				Если ПустаяСтрока(Стр) Тогда
					Продолжить;
				КонецЕсли;
				ИмяОбласти = Лев(Стр, Найти(Стр, "=") - 1);
				URL = Сред(Стр, Найти(Стр, "=") + 1);
				ТекстНеОбработанный = СтрЗаменить(ТекстНеОбработанный, ИмяОбласти, URL);		
			КонецЦикла;
			
			Лог.Информация("Успешное замена URL в обновлении.");
			
		КонецЕсли;
	
		ТД.УстановитьТекст(ТекстНеОбработанный);		
		ТД.Записать(мФайлHTML);
		
		Лог.Информация("Успешное завершение получение текста последнего текущего обновления.");
		
	Исключение
		Лог.Ошибка("Не удалось получить текст последнего текущего обновления конфигурации через " + ИмяCOMСоединителя + " по причине: " + ОписаниеОшибки());
		КодВозврата = 56;
		Возврат;
	КонецПопытки;

	// Очищаем соединения
	Если Соединение <> Неопределено Тогда
		Попытка
			ОсвободитьОбъект(Соединение);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если COMОбъект <> Неопределено Тогда
		Попытка
			ОсвободитьОбъект(COMОбъект);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ВыполнитьСборкуМусора();

КонецПроцедуры

Процедура ОбновитьКонфигурациюИзХранилища()

//				- /F <путь> (тип базы - файловая)
//				- /S <адрес> (тип базы - серверная, <Имя компьютера, работающего сервером приложений>\<Ссылочное имя информационной базы, известное в рамках сервера 1С:Предприятия 8>)
//				- /N (логин администратора ИБ, если не задан, то без логина)
//				- /P (пароль администратора ИБ)
//				- /ConfigurationRepositoryF <путь> (Путь к хранилищу конфигурации)
//				- /ConfigurationRepositoryN логин
//				- /ConfigurationRepositoryP пароль

	Если НЕ ЗначениеЗаполнено(Параметры["/ConfigurationRepositoryF"]) Тогда
		Лог.Ошибка("Не заполнен параметр ""/ConfigurationRepositoryF"" - путь к хранилищу!");
		КодВозврата = 57;
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Параметры["/ConfigurationRepositoryN"]) Тогда
		Лог.Ошибка("Не заполнен параметр ""/ConfigurationRepositoryN"" - пользователь хранилища!");
		КодВозврата = 58;
		Возврат;
	КонецЕсли;

	// Шаг 1. Загружаем все изменения из хранилища
	НомерШага = 1;
	ПараметрыЗапуска 			= Конфигуратор.ПолучитьПараметрыЗапуска();
	ПараметрыЗапуска.Добавить("/ConfigurationRepositoryUpdateCfg -revised -force");
	ПараметрыЗапуска.Добавить("/ConfigurationRepositoryF """ + Параметры["/ConfigurationRepositoryF"] + """");	
	ПараметрыЗапуска.Добавить("/ConfigurationRepositoryN """ + Параметры["/ConfigurationRepositoryN"] + """");
	Если ЗначениеЗаполнено(Параметры["/ConfigurationRepositoryP"]) Тогда
		ПараметрыЗапуска.Добавить("/ConfigurationRepositoryP """ + Параметры["/ConfigurationRepositoryP"] + """");
	КонецЕсли;
		
	Лог.Информация("ШАГ " + Строка(НомерШага)); 
	Лог.Информация("Получаем конфигурацию из хранилища");
	Попытка
	    Конфигуратор.ВыполнитьКоманду(ПараметрыЗапуска);
		Лог.Информация("Получение завершено");
	Исключение												   
		Лог.Ошибка("Произошла ошибка при получении конфигурации из хранилища " + Конфигуратор.ВыводКоманды());		
		КодВозврата = 59;
		Возврат;
	КонецПопытки;
	НомерШага = НомерШага + 1;
	
	// Шаг 2. Обновляем конфигурацию
	ПараметрыЗапуска 			= Конфигуратор.ПолучитьПараметрыЗапуска();
	ПараметрыЗапуска.Добавить("/UpdateDBCfg");
	
	Лог.Информация("ШАГ " + Строка(НомерШага));
	Лог.Информация("Обновление конфигурации базы данных");
	Попытка
	    Конфигуратор.ВыполнитьКоманду(ПараметрыЗапуска);
		Лог.Информация("Обновление конфигурации завершено");
	Исключение												   
		Лог.Ошибка("Произошла ошибка при обновлении конфигурации базы данных " + Конфигуратор.ВыводКоманды());
		КодВозврата = 60;
		Возврат;
	КонецПопытки;
	НомерШага = НомерШага + 1;

	// Обновляем при необходимости
	Результат = ВыполнитьПрограммноеОбновлениеКонфигурации();
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ВыполнитьСборкуМусора();
	
	Лог.Информация("Успешное завершение обновления конфигурации из хранилища.");

КонецПроцедуры

Процедура ОбновитьКонфигурациюИзКаталога()

//				- /F <путь> (тип базы - файловая)
//				- /S <адрес> (тип базы - серверная, <Имя компьютера, работающего сервером приложений>\<Ссылочное имя информационной базы, известное в рамках сервера 1С:Предприятия 8>)
//				- /N (логин администратора ИБ, если не задан, то без логина)
//				- /P (пароль администратора ИБ)
//				- /Catalog <путь> (Путь к каталогу конфигурации)

	Если НЕ ЗначениеЗаполнено(Параметры["/Catalog"]) Тогда
		Лог.Ошибка("Не заполнен параметр ""/Catalog"" - путь каталогу с файлами конфигурации!");
		КодВозврата = 61;
		Возврат;
	КонецЕсли;

	Каталог = Параметры["/Catalog"];

	// Шаг 1. Обновляем конфигурацию из папки
	НомерШага = 1;
	ПараметрыЗапуска 			= Конфигуратор.ПолучитьПараметрыЗапуска();
	ПараметрыЗапуска.Добавить("/LoadConfigFromFiles");
	ПараметрыЗапуска.Добавить("""" + Каталог + """");	
	
	Лог.Информация("ШАГ " + Строка(НомерШага)); 
	Лог.Информация("Загружаем конфигурацию из файлов");
	Попытка
	    Конфигуратор.ВыполнитьКоманду(ПараметрыЗапуска);
		Лог.Информация("Загрузка конфигурации завершена");
	Исключение												   
		Лог.Ошибка("Произошла ошибка при загрузке конфигурации из файлов " + Конфигуратор.ВыводКоманды());		
		КодВозврата = 62;
		Возврат;
	КонецПопытки;
	НомерШага = НомерШага + 1;
	
	Конфигуратор.УстановитьКонтекст("/F" + Параметры["/F"], "", "");
	ПараметрыЗапуска2 	= Конфигуратор.ПолучитьПараметрыЗапуска();
	ПараметрыЗапуска2.Добавить("/UpdateDBCfg");
	
	Лог.Информация("ШАГ " + Строка(НомерШага));
	Лог.Информация("Обновление загруженной конфигурации базы данных");
	Попытка
	    Конфигуратор.ВыполнитьКоманду(ПараметрыЗапуска2);
		Лог.Информация("Обновление загруженной конфигурации завершено");
	Исключение												   
		Лог.Ошибка("Произошла ошибка при обновлении загруженной конфигурации базы данных " + Конфигуратор.ВыводКоманды());
		КодВозврата = 63;
		Возврат;
	КонецПопытки;
	НомерШага = НомерШага + 1;
	
	// Обновляем при необходимости
	Результат = ВыполнитьПрограммноеОбновлениеКонфигурации();
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ВыполнитьСборкуМусора();
	
	Лог.Информация("Успешное завершение загрузки конфигурации из файлов");

КонецПроцедуры

Процедура GitПерейтиВВеткуИПолучить()

//				- /Catalog <путь> (Путь к папке с выгруженной конфигурацией в файлы)
//				- /Branch <ветка> (ветка в GIT)
	
	Если НЕ ЗначениеЗаполнено(Параметры["/Catalog"]) Тогда
		Лог.Ошибка("Не заполнен параметр ""/Catalog"" - путь каталогу с репозитарием git!");
		КодВозврата = 64;
		Возврат;
	КонецЕсли;
	КаталогРепозитория = Параметры["/Catalog"];
	
	Если НЕ ЗначениеЗаполнено(Параметры["/Branch"]) Тогда
		Ветка = "master";
	Иначе
		Ветка = Параметры["/Branch"];
	КонецЕсли;	
	
	НомерШага = 1;	
	Лог.Информация("ШАГ " + Строка(НомерШага)); 
	Лог.Информация("Устанавливаем рабочий каталог");	
	ГитРепозиторий.УстановитьРабочийКаталог(КаталогРепозитория);
	НомерШага = НомерШага + 1;
	
	Если НЕ ГитРепозиторий.ЭтоРепозиторий() Тогда
		Лог.Ошибка("Указанный каталог не является репозитарием git!");
		КодВозврата = 65;
		Возврат;		
	КонецЕсли;
	
	ГитРепозиторий.УстановитьНастройку("core.quotePath", "true", РежимУстановкиНастроекGit.Локально);

	Если ВРег(ГитРепозиторий.ПолучитьТекущуюВетку()) <> ВРег(СокрЛП(Ветка)) Тогда
		Лог.Информация("ШАГ " + Строка(НомерШага)); 
		Лог.Информация("Переходим в ветку " + Ветка);		
		ГитРепозиторий.ПерейтиВВетку(Ветка);
		НомерШага = НомерШага + 1;
	КонецЕсли;
	
	Лог.Информация("ШАГ " + Строка(НомерШага)); 
	Лог.Информация("Получаем изменения из удаленного репозитория ветки " + Ветка);
	ГитРепозиторий.Получить();
	НомерШага = НомерШага + 1;

	ТаблицаПодмодулей = ГитРепозиторий.ПолучитьСостояниеПодмодулей();
	Если ТаблицаПодмодулей.Количество() > 0 Тогда
		Лог.Информация("ШАГ " + Строка(НомерШага)); 
		Лог.Информация("Обновляем подмодули ветки " + Ветка);
		ГитРепозиторий.ОбновитьПодмодули(Истина, Истина);	
	КонецЕсли;

КонецПроцедуры

Процедура ЭкспортПроектаEDTВXML()

//		- /EdtProjectExportToConfigFiles  - экспортировать проект 1C:Enterprise Development Tools в файлы конфигурации платформы 1С:Предприятия.
//				ring edt workspace export --project %CI_PROJECT_DIR%/ --configuration-files %CI_PROJECT_DIR%/config --workspace-location %CI_PROJECT_DIR%/workspace
//				- /Project <проект> (Директория, содержащая проект 1C:Enterprise Development Tools.)
//				- /ConfigurationFiles <адрес> (Обязательный параметр Директория для экспорта файлов конфигурации платформы 1С:Предприятия)
//				- /WorkspaceLocation (Обязательный параметр Директория рабочего простанства для запуска 1C:Enterprise Development Tools.)

	Если НЕ ЗначениеЗаполнено(Параметры["/Project"]) Тогда
		Лог.Ошибка("Не заполнен параметр ""/Project"" - директория, содержащая проект 1C:Enterprise Development Tools!");
		КодВозврата = 66;
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Параметры["/ConfigurationFiles"]) Тогда
		Лог.Ошибка("Не заполнен параметр ""/ConfigurationFiles"" - директория для экспорта файлов конфигурации платформы 1С:Предприятия!");
		КодВозврата = 67;
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Параметры["/WorkspaceLocation"]) Тогда
		Лог.Ошибка("Не заполнен параметр ""/WorkspaceLocation"" - директория рабочего простанства для запуска 1C:Enterprise Development Tools!");
		КодВозврата = 68;
		Возврат;
	КонецЕсли;
	
	Project 			= Параметры["/Project"];
	ConfigurationFiles 	= Параметры["/ConfigurationFiles"];
	WorkspaceLocation 	= Параметры["/WorkspaceLocation"];
	retCode = 0;
	
	Лог.Информация("Экспорт проекта 1C:Enterprise Development Tools в файлы конфигурации платформы 1С:Предприятия (XML)");
	Лог.Информация("Команда: ring edt workspace export --project """ + Project + """ --configuration-files """ + ConfigurationFiles + """ --workspace-location """ + WorkspaceLocation + """");
	ЗапуститьПриложение("ring edt workspace export --project """ + Project + """ --configuration-files """ + ConfigurationFiles + """ --workspace-location """ + WorkspaceLocation + """", , Истина, retCode);
	Лог.Информация("Код возврата " + Строка(retCode)); 
	
КонецПроцедуры

Процедура СоздатьИнформационнуюБазу()

	Лог.Информация("Создание ИБ в каталоге <" + Каталог + ">");
	
	Если НЕ ЗначениеЗаполнено(Параметры["/F"]) Тогда
		Лог.Ошибка("Не заполнен параметр ""/F"" - директория, для создания ИБ");
		КодВозврата = 69;
		Возврат;
	КонецЕсли;
	
	Каталог = Параметры["/F"];
		
	Попытка
	    Конфигуратор.СоздатьФайловуюБазу(Каталог);
		Лог.Информация("Создание ИБ завершено");
	Исключение												   
		Лог.Ошибка("Произошла ошибка при загрузке конфигурации из файлов " + Конфигуратор.ВыводКоманды());
		КодВозврата = 70;
		Возврат;
	КонецПопытки;		
		
	Лог.Информация("Успешное созданние конфигурации.");

КонецПроцедуры

// oscript $(FULL_CURRENT_PATH) /Save1cv8_mft /F C:\Base1C /N "Администратор" /P "" /UPath "d:\_Проекты\Управление IT-отделом 8 УФ\Полные комплекты и обновления" /Destination "SoftOnIT\IT" /DestinationDemo "SoftOnIT\DemoIT"
Процедура Создать_1cv8_mft()
	//		+ /Save1cv8_mft - создание файла 1cv8.mft для обновления
	//				- /UPath <путь> (корневой каталог, где будет создан файл)	
	//				- /Destination
	//				- /DestinationDemo

	мКаталогСборки = Параметры["/UPath"];
	Если НЕ ЗначениеЗаполнено(мКаталогСборки) Тогда
		Лог.Ошибка("Не заполнен параметр ""/UPath"" - каталог куда сохранфить файл 1cv8.mft!");
		КодВозврата = 71;
		Возврат;
	Иначе
		Файл = Новый Файл(мКаталогСборки);
		Если Не Файл.Существует() Тогда		
			Лог.Ошибка("Каталог """ + мКаталогСборки + """" + " не существует для сохранения 1cv8.mft.");
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	мКаталогСборки = ДополнитьСтрокуСлешем(мКаталогСборки);	

	мНазначение = Параметры["/Destination"];
	Если НЕ ЗначениеЗаполнено(мНазначение) Тогда
		Лог.Ошибка("Не заполнен параметр ""/Destination"" - путь куда устанавливать конфигурацию!");
		КодВозврата = 72;
		Возврат;	
	КонецЕсли;	
	
	мНазначениеДемо = Параметры["/DestinationDemo"];
	Если НЕ ЗначениеЗаполнено(мНазначениеДемо) Тогда
		Лог.Ошибка("Не заполнен параметр ""/DestinationDemo"" - путь куда устанавливать демо-конфигурацию!");
		КодВозврата = 73;
		Возврат;	
	КонецЕсли;
	
	Лог.Информация("Начало создания файла 1cv8.mft");
	
	Инфо = ИнформацияОКонфигурации();
	мНазвание = Инфо.СинонимКонфигурации;
	
	// Генерируем новый файл 1cv8.mft
	Файл = Новый ТекстовыйДокумент;
	Файл.ДобавитьСтроку("Vendor=" + Инфо.Поставщик);
	Файл.ДобавитьСтроку("Name=" + Инфо.ИмяКонфигурации);
	Файл.ДобавитьСтроку("Version=" + Инфо.ВерсияКонфигурации);
	Файл.ДобавитьСтроку("AppVersion=8.3");
	Файл.ДобавитьСтроку("[Config1]");
	Файл.ДобавитьСтроку("Catalog=" + мНазвание);
	Файл.ДобавитьСтроку("Destination=" + мНазначение);
	Файл.ДобавитьСтроку("Source=1Cv8.cf");
	Файл.ДобавитьСтроку("[Config2]");
	Файл.ДобавитьСтроку("Catalog=" + мНазвание + " (демо)");
	Файл.ДобавитьСтроку("Destination=" + мНазначениеДемо);
	Файл.ДобавитьСтроку("Source=1Cv8.dt");
	Файл.Записать(мКаталогСборки + "1cv8.mft");

	Лог.Информация("Файл 1cv8.mft создан");	

КонецПроцедуры

// oscript $(FULL_CURRENT_PATH) /SaveInstall_edf /F C:\Base1C /N "Администратор" /P "" /UPath "d:\_Проекты\Управление IT-отделом 8 УФ\Полные комплекты и обновления"
Процедура Создать_Install_edf()
	//		+ /SaveInstall_edf - создание файла install.edf для обновления
	//				- /UPath <путь> (корневой каталог, где будет создан файл)	

	мКаталогСборки = Параметры["/UPath"];
	Если НЕ ЗначениеЗаполнено(мКаталогСборки) Тогда
		Лог.Ошибка("Не заполнен параметр ""/UPath"" - каталог куда сохранфить файл 1cv8.mft!");
		КодВозврата = 74;
		Возврат;
	Иначе
		Файл = Новый Файл(мКаталогСборки);
		Если Не Файл.Существует() Тогда		
			Лог.Ошибка("Каталог """ + мКаталогСборки + """" + " не существует для сохранения 1cv8.mft.");
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	мКаталогСборки = ДополнитьСтрокуСлешем(мКаталогСборки);
	
	Лог.Информация("Начало создания файла install.edf");
	
	Инфо = ИнформацияОКонфигурации();
	
	// Генерируем новый файл install.edf
	Версия = Инфо.ВерсияКонфигурации; // "3.1.7.7";

	ВерсияПодчеркивания = СтрЗаменить(Версия, ".", "_");
	мКаталогСборкиВерсия = мКаталогСборки + Версия + "\";

	// Генерируем новый файл install.edf
	Файл = Новый ТекстовыйДокумент;
	Файл.ДобавитьСтроку("{1,");
	Файл.ДобавитьСтроку("{");
	Файл.ДобавитьСтроку("{1,2,");
	Файл.ДобавитьСтроку("{""en"",""ООО """"Софтонит"""" (Барилко Виталий Викторович)""},");
	Файл.ДобавитьСтроку("{""ru"",""ООО """"Софтонит"""" (Барилко Виталий Викторович)""}");
	Файл.ДобавитьСтроку("},");
	Файл.ДобавитьСтроку("{1,2,");
	Файл.ДобавитьСтроку("{""en"",""" + Инфо.СинонимКонфигурации + """},");
	Файл.ДобавитьСтроку("{""ru"",""" + Инфо.СинонимКонфигурации + """}");
	Файл.ДобавитьСтроку("},");
	Файл.ДобавитьСтроку("{#base64:}");
	Файл.ДобавитьСтроку("},");
	Файл.ДобавитьСтроку("{1,");
	Файл.ДобавитьСтроку("{1,0,""" + Инфо.ИмяКонфигурации + """,""ООО """"Софтонит"""" (Барилко Виталий Викторович)"",""" + Версия + """,""SoftOnIT\it3\" + ВерсияПодчеркивания + """,");
	Файл.ДобавитьСтроку("{");
	Файл.ДобавитьСтроку("{""/"",");
	Файл.ДобавитьСтроку("{7,");
	Файл.ДобавитьСтроку("{c61a3081-db7b-4d57-b836-150d73beff1f,""Файл конфигурации"",1,00000000-0000-0000-0000-000000000000,""" + Инфо.СинонимКонфигурации + ""","""",00000000-0000-0000-0000-000000000000,"""",1,1,1,1},");
	Файл.ДобавитьСтроку("{ed7bf966-330d-46f0-9bf0-57a0db7ecd04,""Файл выгрузки информационной базы"",1,00000000-0000-0000-0000-000000000000,""" + Инфо.СинонимКонфигурации + " (демо)"","""",00000000-0000-0000-0000-000000000000,"""",0,2,1,1},");
	Файл.ДобавитьСтроку("{a73646ed-6000-4541-b5d7-3b76985639f8,""1cv8upd.htm"",0,"""",00000000-0000-0000-0000-000000000000,""" + мКаталогСборкиВерсия + "Дополнительные файлы\1cv8upd.htm"",0,0,0,0},");
	Файл.ДобавитьСтроку("{49e79e4d-ce7d-4197-b966-a5082632a23e,""ReadMe.txt"",0,"""",00000000-0000-0000-0000-000000000000,""" + мКаталогСборкиВерсия + "Дополнительные файлы\ReadMe.txt"",0,0,0,0},");
	Файл.ДобавитьСтроку("{14503a27-1ad8-472e-a13b-2aedfca7e89f,""UpdInfo.txt"",0,"""",00000000-0000-0000-0000-000000000000,""" + мКаталогСборкиВерсия + "Дополнительные файлы\UpdInfo.txt"",0,0,0,0},");
	Файл.ДобавитьСтроку("{9def14b2-01de-46a0-9550-d509dcf78d74,""1Cv8.cfu"",0,"""",00000000-0000-0000-0000-000000000000,""" + мКаталогСборкиВерсия + "1Cv8.cfu"",0,0,0,0},");
	Файл.ДобавитьСтроку("{87728706-8f7f-464d-9ec2-bb85454faa27,""1cv8.mft"",0,"""",00000000-0000-0000-0000-000000000000,""" + мКаталогСборки + "1cv8.mft"",0,0,0,0}");
	Файл.ДобавитьСтроку("},");
	Файл.ДобавитьСтроку("{1,");
	Файл.ДобавитьСтроку("{366f16f3-e8bf-455a-a547-b990015c4a94,""Общие файлы"",00000000-0000-0000-0000-000000000000,""" + мКаталогСборки + "Общие файлы для дистрибутива"",""*.*"",1}");
	Файл.ДобавитьСтроку("},");
	Файл.ДобавитьСтроку("{0}");
	Файл.ДобавитьСтроку("}");
	Файл.ДобавитьСтроку("}");
	Файл.ДобавитьСтроку("}");
	Файл.ДобавитьСтроку("},");
	Файл.ДобавитьСтроку("{0},");
	Файл.ДобавитьСтроку("{2,""Полный"",0,");
	Файл.ДобавитьСтроку("{0},00000000-0000-0000-0000-000000000000,"""",00000000-0000-0000-0000-000000000000,"""",""Обновление"",1,""ru"",a73646ed-6000-4541-b5d7-3b76985639f8,");
	Файл.ДобавитьСтроку("{5,9def14b2-01de-46a0-9550-d509dcf78d74,a73646ed-6000-4541-b5d7-3b76985639f8,49e79e4d-ce7d-4197-b966-a5082632a23e,14503a27-1ad8-472e-a13b-2aedfca7e89f,366f16f3-e8bf-455a-a547-b990015c4a94},00000000-0000-0000-0000-000000000000,"""",00000000-0000-0000-0000-000000000000,""""},");
	Файл.ДобавитьСтроку("{0}");
	Файл.ДобавитьСтроку("}");
	Файл.Записать(мКаталогСборки + "install.edf");

	Лог.Информация("Файл install.edf создан");	

КонецПроцедуры

// oscript $(FULL_CURRENT_PATH) /BuildDistrib /F "D:\_Проекты\Управление IT-отделом 8 УФ\Пустая конфигурация для обновления" /N "Администратор" /P "" /UPath "d:\_Проекты\Управление IT-отделом 8 УФ\Полные комплекты и обновления" /NVer "3.0.27.6" /NeedVerPL "8.3.6"
Процедура СоздатьДистрибутив()	
	
	// Шаг 0. Проверка заполненных параметров
	мКаталогСборки = Параметры["/UPath"];
	Если НЕ ЗначениеЗаполнено(мКаталогСборки) Тогда
		Лог.Ошибка("Не заполнен параметр ""/UPath"" - каталог сборки (где будет создан дистрибутив)!");
		КодВозврата = 75;
		Возврат;
	Иначе
		Файл = Новый Файл(мКаталогСборки);
		Если Не Файл.Существует() Тогда		
			Лог.Ошибка("Каталог """ + мКаталогСборки + """" + " не существует для создания дистрибутива.");
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	мКаталогСборки = ДополнитьСтрокуСлешем(мКаталогСборки);	
	
	// Обновляем при необходимости
	Результат = ВыполнитьПрограммноеОбновлениеКонфигурации();
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	мВерсияКонфигурации 	= Результат.мВерсияКонфигурации;
	мИмяКонфигурации 		= Результат.мИмяКонфигурации;
	мСинонимКонфигурации 	= Результат.мСинонимКонфигурации;	
	ВыполнитьСборкуМусора();
	
	// ШАГ 4. Создаем папки и будущую навигацию
	Лог.Информация("Создание каталогов и заполнение вспомогательных данных.");
	мВерсииОбновлений = Параметры["/NVer"];
	мМассивВерсий = РазложитьСтрокуВМассивПодстрок(мВерсииОбновлений);
	
	мКаталогВерсии 						= ДополнитьСтрокуСлешем(мКаталогСборки + мВерсияКонфигурации);
	мКаталогВерсииПолный 				= ДополнитьСтрокуСлешем(мКаталогВерсии + "Полный");
	мКаталогВерсииОбновление 			= ДополнитьСтрокуСлешем(мКаталогВерсии + "Обновление");
	мКаталогВерсииДополнительныеФайлы 	= ДополнитьСтрокуСлешем(мКаталогВерсии + "Дополнительные файлы");
	
	Файл = Новый Файл(мКаталогСборки);
	// Удаляем все файлы в папке сборки, если она есть
	Если Файл.Существует() Тогда
		Попытка
			УдалитьФайлы(мКаталогВерсии);
		Исключение
			Лог.Ошибка("Не удалось удалить каталог со старой версией, для новой сборки: " + ОписаниеОшибки());
			КодВозврата = 76;
			Возврат;
		КонецПопытки;
	КонецЕсли;

	// Создаем каталоги
	СоздатьКаталог(мКаталогВерсии);
	СоздатьКаталог(мКаталогВерсииПолный);	
	СоздатьКаталог(мКаталогВерсииДополнительныеФайлы);
	
	// Нужно делать и обновление
	мСтрокаСВерсиями = "";
	Если мМассивВерсий.Количество() > 0 Тогда
		СоздатьКаталог(мКаталогВерсииОбновление);
		// Создаем UpdInfo.txt
		ТД = Новый ТекстовыйДокумент;
		ТекстВерсий = "Version=" + мВерсияКонфигурации + Символы.ПС + "FromVersions=;";
		Для Каждого мВерсия Из мМассивВерсий Цикл
			ТекстВерсий = ТекстВерсий + мВерсия + ";";
			Если НЕ ПустаяСтрока(мСтрокаСВерсиями) Тогда
				мСтрокаСВерсиями = мСтрокаСВерсиями + ", ";
			КонецЕсли;
			мСтрокаСВерсиями = мСтрокаСВерсиями + мВерсия;
		КонецЦикла;
		ТекстВерсий = ТекстВерсий + Символы.ПС + "UpdateDate=" + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
		ТД.УстановитьТекст(ТекстВерсий);
		ТД.Записать(мКаталогВерсииДополнительныеФайлы + "UpdInfo.txt");
	КонецЕсли;
	
	// Создаем ReadMe.txt
	ТД = Новый ТекстовыйДокумент;
	Текст = "Конфигурация """ + мСинонимКонфигурации + """" + Символы.ПС + 
		"Версия " + мВерсияКонфигурации + Символы.ПС +
		"=================================================================" + Символы.ПС + Символы.ПС +		
		"Внимание!"+ Символы.ПС +
		"Текущая версия конфигурации """ + мСинонимКонфигурации + """ предназначена"+ Символы.ПС +
		"для использования с версией системы 1С:Предприятие 8.3 не ниже " + Параметры["/NeedVerPL"];
	ТД.УстановитьТекст(Текст);
	ТД.Записать(мКаталогВерсииДополнительныеФайлы + "ReadMe.txt");
	
	ПолучитьОписаниеОбновленияИзМакета(мКаталогСборки + "news.html");
	ВыполнитьСборкуМусора();
	
	// Создаем 1cv8upd.htm
	ТД = Новый ТекстовыйДокумент;
	мТекстНовостей = "";
	Файл = Новый Файл(мКаталогСборки);
	Если Файл.Существует() Тогда			
		ТД.Прочитать(мКаталогСборки + "news.html");
		мТекстНовостей = ТД.ПолучитьТекст();
	КонецЕсли;	
	Текст = "<HTML><HEAD>
			|<META http-equiv=Content-Type content=""text/html; charset=utf-8""><LINK href=""__STYLE__"" type=text/css rel=stylesheet><BASE href=v8config://1F802B99-D580-4E0F-93A3-F3F36B54052D/mdobject/id85895E9C-8000-4F0E-8DFD-B67B5FE6CC6C/8EB4FAD1-1FA6-403E-970F-2C12DBB43E23>
			|<META content=""MSHTML 6.00.2900.5969"" name=GENERATOR></HEAD>
			|<style type=""text/css"">
			|.updnew li:before{color:#090;content:""[+] "";font-family:""Courier New"",Courier,monospace;font-weight:bold;font-style:normal;list-style:none;}
			|.updedt li:before{color:#005EF9;content:""[*] "";font-family:""Courier New"",Courier,monospace;font-weight:bold;font-style:normal;list-style:none;}
			|.upderr li:before{color:#FF0000;content:""[-] "";font-family:""Courier New"",Courier,monospace;font-weight:bold;font-style:normal;list-style:none;}
			|.updnws li:before{color:#810A0A;content:""[#] "";font-family:""Courier New"",Courier,monospace;font-weight:bold;font-style:normal;list-style:none;}
			|</style>
			|<BODY>
			|<TABLE style=""BORDER-RIGHT: black 1px solid; BORDER-TOP: black 1px solid; BORDER-LEFT: black 1px solid; BORDER-BOTTOM: black 1px solid"" cellSpacing=0 cellPadding=8 width=""100%"" bgColor=#ffffd6 border=0>
			|<TBODY>
			|<TR>
			|<TD>
			|<H2><FONT face=Tahoma color=#c10000>Конфигурация<BR>" + мСинонимКонфигурации + "</FONT></FONT></H2></TD></TR></TBODY></TABLE>
			|<H3 style=""BORDER-BOTTOM: #c10000 2px solid""><FONT face=Arial color=#c10000 size=5><EM>Версия&nbsp;" + мВерсияКонфигурации + "</EM></FONT></H3>
			|<H4><FONT face=Verdana color=#823602>Порядок обновления всех конфигураций</FONT></H4>
			|<OL>
			|<LI>Запустите систему 1С:Предприятие в режиме ""Конфигуратор"".
			|<LI><B>Обязательно сделайте архивную копию вашей информационной базы!</B> Для этого надо в меню Администрирование выбрать пункт ""Выгрузить информационную базу"" и ввести имя файла выгрузки. Этот файл надо сохранить в надёжном месте.
			|<LI>В режиме ""Конфигуратор"" откройте конфигурацию, для этого в меню ""Конфигурация"" выберите пункт ""Открыть конфигурацию"".
			|<LI>Вызовите режим ""Обновление конфигураций"", для этого в меню ""Конфигурация"", подменю ""Поддержка"", выберите пункт ""Обновить конфигурацию"".
			|<LI>В диалоге выбора обновления в качестве источника обновления укажите ""Доступные обновления"", после чего выберите нужное обновление в соответствующем списке.
			|<LI>Если в списке обновлений необходимое обновление отсутствует, то в диалоге выбора обновления в качестве источника обновления укажите ""Файл обновления"", после чего выберите нужный файл обновления (по умолчанию 1cv8.cfu).
			|<LI>В окне ""Обновление конфигураций"" нажмите кнопку ""OK"" для продолжения обновления конфигурации.
			|<LI>На вопрос об обновлении конфигурации базы данных ответьте ""ДА"".
			|<LI>После завершения <B>обязательно</B> запустите программу в режиме ""Предприятие"" - для совершения конвертации. Некоторые пользователи не выходя из конфигуратора последовательно обновляют версии - это недопустимо и повлечет за собой невозможность дальнейшей работы. После каждого обновления надо хотя бы 1 раз запускать 1С в режиме 1С:Предприятие.</LI></OL>
			|<H4><FONT face=Verdana color=#823602>Порядок обновления конфигурации версий " + мСтрокаСВерсиями + " на версию " + мВерсияКонфигурации + "</FONT></H4>
			|<P>Для обновления версии конфигурации следует использовать режим ""Обновление конфигураций"". Файл обновлений 1Cv8.cfu находится в каталоге шаблонов (по умолчанию - подкаталог tmplts\ каталога установки 1С:Предприятия 8), в подкаталоге SoftOnIT\it3\" + СтрЗаменить(мВерсияКонфигурации, ".", "_") + "\</P>
			|</SPAN><hr><font color=""#ff0000"">Внимание!<br>Текущая версия конфигурации """ + мСинонимКонфигурации + """ предназначена для использования с версией системы 1С:Предприятие 8.3 не ниже " + Параметры["/NeedVerPL"] + ".</font><hr>" + 
			мТекстНовостей + "
			|</BODY></HTML>";
	ТД.УстановитьТекст(Текст);
	ТД.Записать(мКаталогВерсииДополнительныеФайлы + "1cv8upd.htm");		
	
	ВыполнитьСборкуМусора();
	
	// ШАГ 5. Создаем файл поставки
	ПараметрыЗапуска3 			= Конфигуратор.ПолучитьПараметрыЗапуска();
	ПараметрыЗапуска3.Добавить("/CreateDistributionFiles");
	// Создаем дистрибутив
	ПараметрыЗапуска3.Добавить("-cffile """ + мКаталогВерсии + "1Cv8.cf" + """");
	Если мМассивВерсий.Количество() > 0 Тогда
		// Если надо, создаем обновления
		ПараметрыЗапуска3.Добавить("-cfufile """ + мКаталогВерсии + "1Cv8.cfu" + """");
		Для Каждого мВерсия Из мМассивВерсий Цикл
			ПараметрыЗапуска3.Добавить("-f """ + мКаталогСборки + СокрЛП(мВерсия) + "\1Cv8.cf""");
		КонецЦикла;
	КонецЕсли;

	Лог.Информация("Создание файла поставки");
	Попытка		
		Конфигуратор.ВыполнитьКоманду(ПараметрыЗапуска3);
		Лог.Информация("Создание файла поставки завершено");
	Исключение												   
		Лог.Ошибка("Произошла ошибка при создании файла поставки " + Конфигуратор.ВыводКоманды());
		КодВозврата = 77;
		Возврат;
	КонецПопытки;
	
	// ШАГ 6. Создание дистрибутива
	ПараметрыЗапуска4 			= Конфигуратор.ПолучитьПараметрыЗапуска();
	ПараметрыЗапуска4.Добавить("/CreateDistributive """ + мКаталогВерсииПолный + """");
	ПараметрыЗапуска4.Добавить("-File """ + мКаталогСборки + "install.edf" + """");
	ПараметрыЗапуска4.Добавить("-MakeSetup");	
	
	Лог.Информация("Создание дистрибутива");
	Попытка
		Конфигуратор.ВыполнитьКоманду(ПараметрыЗапуска4);
		Лог.Информация("Создание дистрибутива завершено");
		
		// Делаем архив
		ЗаписьZIP =  Новый ЗаписьZipФайла(мКаталогВерсииПолный + "full.zip");     
		ЗаписьZIP.Добавить(мКаталогВерсииПолный + "*.*",
			РежимСохраненияПутейZIP.СохранятьОтносительныеПути,
			РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);		
		ЗаписьZIP.Записать();
		Лог.Информация("Создание архива дистрибутива завершено");
		
	Исключение												   
		Лог.Ошибка("Произошла ошибка при создании дистрибутива " + Конфигуратор.ВыводКоманды());
		КодВозврата = 78;
		//Возврат;
	КонецПопытки;
	
	// ШАГ 7. Создание обновления
	Если мМассивВерсий.Количество() > 0 Тогда
		ПараметрыЗапуска5 			= Конфигуратор.ПолучитьПараметрыЗапуска();
		ПараметрыЗапуска5.Добавить("/CreateDistributive """ + мКаталогВерсииОбновление + """");
		ПараметрыЗапуска5.Добавить("-File """ + мКаталогСборки + "install.edf" + """");
		ПараметрыЗапуска5.Добавить("-Option Обновление");
		ПараметрыЗапуска5.Добавить("-MakeSetup");

		Лог.Информация("Создание обновления дистрибутива");
		Попытка
			Конфигуратор.ВыполнитьКоманду(ПараметрыЗапуска5);
			Лог.Информация("Создание обновления дистрибутива завершено");
			
			// Делаем архив
			ЗаписьZIP =  Новый ЗаписьZipФайла(мКаталогВерсииОбновление + мВерсияКонфигурации + ".zip");     
			ЗаписьZIP.Добавить(мКаталогВерсииОбновление + "*.*",
				РежимСохраненияПутейZIP.СохранятьОтносительныеПути,
				РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
			ЗаписьZIP.Записать();
			Лог.Информация("Создание архива обновления дистрибутива завершено");
			
		Исключение												   
			Лог.Ошибка("Произошла ошибка при создании обновления дистрибутива " + Конфигуратор.ВыводКоманды());
			КодВозврата = 79;
			//Возврат;
		КонецПопытки;
			
	КонецЕсли;
	
	//Лог.Информация("ВНИМАНИЕ! Далее сделайте архив поставки вручную из конфигуратора!");
	Лог.Информация("Успешное завершение сборки.");
	
КонецПроцедуры

Процедура УстановитьURLы()
//		+ /SetURLS
//				- File
//				- FileURL
	
	мФайл = Параметры["/File"];
	Лог.Информация("Начало замены URL-ов в файле");	
	Если НЕ ЗначениеЗаполнено(мФайл) Тогда
		Лог.Ошибка("Не заполнен параметр ""/File"" - файл HTML или TXT");
		КодВозврата = 80;
		Возврат;
	КонецЕсли;
	Лог.Информация("Обрабатываемый файл <" + мФайл + ">");	

	мФайлURL = Параметры["/FileURL"];
	Если НЕ ЗначениеЗаполнено(мФайлURL) Тогда
		Лог.Ошибка("Не заполнен параметр ""/FileURL"" - файл с расшифровкой URL");
		КодВозврата = 81;
		Возврат;
	КонецЕсли;
	Лог.Информация("Файл UTL <" + мФайлURL + ">");	
	
	Массив = Новый Массив;	
	Массив.Добавить(мФайл);

	ФайлURL = Новый ТекстовыйДокумент;
	ФайлURL.Прочитать(мФайлURL);
	ТекстURL = ФайлURL.ПолучитьТекст();	

	Для Каждого ИмяФайла Из Массив Цикл

		Файл = Новый ТекстовыйДокумент;
		Файл.Прочитать(ИмяФайла);
		Текст = Файл.ПолучитьТекст();	
		Для Индекс = 1 По СтрЧислоСтрок(ТекстURL) Цикл
			Стр = СтрПолучитьСтроку(ТекстURL, Индекс);
			Если ПустаяСтрока(Стр) Тогда
				Продолжить;
			КонецЕсли;
			ИмяОбласти = Лев(Стр, Найти(Стр, "=") - 1);
			URL = Сред(Стр, Найти(Стр, "=") + 1);
			Текст = СтрЗаменить(Текст, "[url=" + ИмяОбласти + "]", "[url=" + URL + "]");
			Текст = СтрЗаменить(Текст, "href=""" + ИмяОбласти + """", "href=""" + URL + """");
		КонецЦикла;
		Файл.УстановитьТекст(Текст);
		Файл.Записать(ИмяФайла);
		
	КонецЦикла;
	
	Лог.Информация("Успешное завершение замены URL-ов в файле <" + мФайл + ">");
	
КонецПроцедуры

Процедура ОтправкаНовостей()

//		+ /SendNews
//				- URL
//				- IDProgram
//				- IDCatalog
//				- File

	Лог.Информация("Начало отправки новостей на сайт");
	
	мHTTP = Параметры["/URL"];
	Если НЕ ЗначениеЗаполнено(мHTTP) Тогда
		Лог.Ошибка("Не заполнен параметр ""/URL"" - файл HTML или TXT");
		КодВозврата = 82;
		Возврат;
	КонецЕсли;
	ИДПрограммы = Параметры["/IDProgram"];
	Если НЕ ЗначениеЗаполнено(ИДПрограммы) Тогда
		Лог.Ошибка("Не заполнен параметр ""/IDProgram"" - ID программы на сайте");
		КодВозврата = 83;
		Возврат;
	КонецЕсли;
	ИДКаталога = Параметры["/IDCatalog"];
	Если НЕ ЗначениеЗаполнено(ИДКаталога) Тогда
		Лог.Ошибка("Не заполнен параметр ""/IDCatalog"" - ID каталога на сайте");
		КодВозврата = 84;
		Возврат;
	КонецЕсли;
	ИмяФайлаДляЗагрузкиHTML = Параметры["/File"];
	Если НЕ ЗначениеЗаполнено(ИмяФайлаДляЗагрузкиHTML) Тогда
		Лог.Ошибка("Не заполнен параметр ""/File"" - имя файла HTML для отправки на сайте");
		КодВозврата = 85;
		Возврат;
	КонецЕсли;
	Лог.Информация("Страница запуска: " + мHTTP);	

	Попытка
		WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
	Исключение
		Лог.Ошибка("Ошибка создания COM-объекта WinHttp.WinHttpRequest.5.1");
		КодВозврата = 86;
	КонецПопытки

	Boundary = "00000000000000";
	ФайлДанных = ИмяФайлаДляЗагрузкиHTML;

	СтрокаBase64 = Base64Строка(Новый ДвоичныеДанные(ИмяФайлаДляЗагрузкиHTML));

	Данные = 
		"--" + Boundary + "
		|Content-Disposition: form-data; name=""data""; filename=""" + ФайлДанных + """
		|Content-Type: application/octet-stream;
		|
		|" + СтрокаBase64 + Символы.ПС + "
		|--" + Boundary + "
		|Content-disposition: form-data; name=""program""
		|Content-Type: application/octet-stream;
		|
		|" + ИДПрограммы + "
		|--" + Boundary + "
		|Content-disposition: form-data; name=""group""
		|Content-Type: application/octet-stream;
		|
		|" + ИДКаталога + "
		|--" + Boundary + "--";
		

	WinHttp.Open("POST", мHTTP, 0);
	WinHttp.SetRequestHeader("Content-Type","multipart/form-data;boundary=" + Boundary);
	WinHttp.SetRequestHeader("Content-Length", СтрДлина(Данные));
	WinHttp.Send(Данные);
	
	Лог.Информация(WinHttp.ResponseText);
	Лог.Информация("Окончание отправки новостей на сайт");

КонецПроцедуры

ЗадатьНачальныеНастройки();
ИнициализацияСистемныхПеременных();
юсВыполнитьКоманду();

ВременныеФайлы.Удалить();
ЗавершитьРаботу(КодВозврата);